def make_aliases(name):
    ... # см. оригинальную функцию

GROUPS_FULL = {
    "726": {
        "name": "КИПр-22-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/aies_t/aies.php?action=group&union=0&sid=28704&gr=726&year=2025&vr=1",
        "aliases": [
            "Кипр-22-(9)-1",
            "КИПр 22 9 1",
            "Кипр 22 9 1",
            "КИПР-22-9-1",
            "кипр-22-9-1",
            "КИПР-22-(9)-1",
            "Кипр-22-9-1",
            "кипр-22-(9)-1",
            "кипр 22 9 1",
            "КИПР 22 9 1",
            "КИПр-22-(9)-1",
            "КИПр-22-9-1"
        ],
        "department": "АиЭС",
        "specialty": "КИПр"
    },
    "768": {
        "name": "КИПр-23-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/aies_t/aies.php?action=group&union=0&sid=28704&gr=768&year=2025&vr=1",
        "aliases": [
            "КИПр-23-(9)-1",
            "Кипр 23 9 1",
            "КИПР-23-(9)-1",
            "Кипр-23-9-1",
            "КИПр 23 9 1",
            "КИПР 23 9 1",
            "кипр-23-9-1",
            "КИПР-23-9-1",
            "Кипр-23-(9)-1",
            "кипр-23-(9)-1",
            "кипр 23 9 1",
            "КИПр-23-9-1"
        ],
        "department": "АиЭС",
        "specialty": "КИПр"
    },
    "842": {
        "name": "КИПр-24-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/aies_t/aies.php?action=group&union=0&sid=28704&gr=842&year=2025&vr=1",
        "aliases": [
            "КИПр-24-(9)-1",
            "Кипр-24-9-1",
            "КИПР 24 9 1",
            "кипр-24-9-1",
            "Кипр-24-(9)-1",
            "Кипр 24 9 1",
            "КИПр 24 9 1",
            "кипр-24-(9)-1",
            "КИПр-24-9-1",
            "кипр 24 9 1",
            "КИПР-24-(9)-1",
            "КИПР-24-9-1"
        ],
        "department": "АиЭС",
        "specialty": "КИПр"
    },
    "843": {
        "name": "КИПр-24-(11)-1",
        "url": "https://coworking.tyuiu.ru/shs/aies_t/aies.php?action=group&union=0&sid=28704&gr=843&year=2025&vr=1",
        "aliases": [
            "КИПр 24 11 1",
            "КИПР 24 11 1",
            "Кипр-24-(11)-1",
            "КИПр-24-11-1",
            "КИПР-24-(11)-1",
            "КИПР-24-11-1",
            "Кипр 24 11 1",
            "кипр-24-(11)-1",
            "КИПр-24-(11)-1",
            "Кипр-24-11-1",
            "кипр 24 11 1",
            "кипр-24-11-1"
        ],
        "department": "АиЭС",
        "specialty": "КИПр"
    },
    "672": {
        "name": "КСт-21-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/aies_t/aies.php?action=group&union=0&sid=28704&gr=672&year=2025&vr=1",
        "aliases": [
            "кст 21 9 1",
            "КСт-21-9-1",
            "КСт-21-(9)-1",
            "Кст-21-(9)-1",
            "Кст 21 9 1",
            "КСт 21 9 1",
            "Кст-21-9-1",
            "КСТ-21-(9)-1",
            "КСТ-21-9-1",
            "кст-21-9-1",
            "КСТ 21 9 1",
            "кст-21-(9)-1"
        ],
        "department": "АиЭС",
        "specialty": "КСт"
    },
    "728": {
        "name": "КСт-22-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/aies_t/aies.php?action=group&union=0&sid=28704&gr=728&year=2025&vr=1",
        "aliases": [
            "КСт-22-9-1",
            "КСт 22 9 1",
            "КСТ-22-(9)-1",
            "КСт-22-(9)-1",
            "Кст-22-(9)-1",
            "Кст-22-9-1",
            "кст 22 9 1",
            "КСТ-22-9-1",
            "Кст 22 9 1",
            "кст-22-9-1",
            "кст-22-(9)-1",
            "КСТ 22 9 1"
        ],
        "department": "АиЭС",
        "specialty": "КСт"
    },
    "729": {
        "name": "КСт-22-(11)-1",
        "url": "https://coworking.tyuiu.ru/shs/aies_t/aies.php?action=group&union=0&sid=28704&gr=729&year=2025&vr=1",
        "aliases": [
            "КСт 22 11 1",
            "Кст-22-(11)-1",
            "кст-22-11-1",
            "Кст-22-11-1",
            "КСТ-22-11-1",
            "Кст 22 11 1",
            "кст-22-(11)-1",
            "КСт-22-(11)-1",
            "КСТ-22-(11)-1",
            "кст 22 11 1",
            "КСТ 22 11 1",
            "КСт-22-11-1"
        ],
        "department": "АиЭС",
        "specialty": "КСт"
    },
    "769": {
        "name": "КСт-23-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/aies_t/aies.php?action=group&union=0&sid=28704&gr=769&year=2025&vr=1",
        "aliases": [
            "КСТ-23-(9)-1",
            "Кст 23 9 1",
            "КСт-23-(9)-1",
            "Кст-23-9-1",
            "кст 23 9 1",
            "кст-23-9-1",
            "Кст-23-(9)-1",
            "КСТ 23 9 1",
            "КСт 23 9 1",
            "КСт-23-9-1",
            "КСТ-23-9-1",
            "кст-23-(9)-1"
        ],
        "department": "АиЭС",
        "specialty": "КСт"
    },
    "770": {
        "name": "КСт-23-(9)-2",
        "url": "https://coworking.tyuiu.ru/shs/aies_t/aies.php?action=group&union=0&sid=28704&gr=770&year=2025&vr=1",
        "aliases": [
            "КСТ 23 9 2",
            "кст-23-9-2",
            "КСТ-23-9-2",
            "КСт-23-9-2",
            "Кст 23 9 2",
            "Кст-23-(9)-2",
            "кст-23-(9)-2",
            "КСт 23 9 2",
            "КСТ-23-(9)-2",
            "кст 23 9 2",
            "Кст-23-9-2",
            "КСт-23-(9)-2"
        ],
        "department": "АиЭС",
        "specialty": "КСт"
    },
    "775": {
        "name": "КСт-23-(11)-1",
        "url": "https://coworking.tyuiu.ru/shs/aies_t/aies.php?action=group&union=0&sid=28704&gr=775&year=2025&vr=1",
        "aliases": [
            "кст-23-(11)-1",
            "КСТ 23 11 1",
            "КСт-23-11-1",
            "КСт-23-(11)-1",
            "КСТ-23-(11)-1",
            "Кст 23 11 1",
            "Кст-23-(11)-1",
            "Кст-23-11-1",
            "КСт 23 11 1",
            "КСТ-23-11-1",
            "кст-23-11-1",
            "кст 23 11 1"
        ],
        "department": "АиЭС",
        "specialty": "КСт"
    },
    "844": {
        "name": "КСт-24-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/aies_t/aies.php?action=group&union=0&sid=28704&gr=844&year=2025&vr=1",
        "aliases": [
            "кст 24 9 1",
            "КСт 24 9 1",
            "Кст-24-9-1",
            "КСт-24-(9)-1",
            "кст-24-(9)-1",
            "КСт-24-9-1",
            "Кст-24-(9)-1",
            "Кст 24 9 1",
            "КСТ-24-9-1",
            "кст-24-9-1",
            "КСТ 24 9 1",
            "КСТ-24-(9)-1"
        ],
        "department": "АиЭС",
        "specialty": "КСт"
    },
    "845": {
        "name": "КСт-24-(9)-2",
        "url": "https://coworking.tyuiu.ru/shs/aies_t/aies.php?action=group&union=0&sid=28704&gr=845&year=2025&vr=1",
        "aliases": [
            "кст-24-9-2",
            "КСТ-24-(9)-2",
            "кст-24-(9)-2",
            "КСт 24 9 2",
            "кст 24 9 2",
            "Кст-24-9-2",
            "Кст-24-(9)-2",
            "Кст 24 9 2",
            "КСт-24-9-2",
            "КСТ-24-9-2",
            "КСТ 24 9 2",
            "КСт-24-(9)-2"
        ],
        "department": "АиЭС",
        "specialty": "КСт"
    },
    "846": {
        "name": "КСт-24-(11)-1",
        "url": "https://coworking.tyuiu.ru/shs/aies_t/aies.php?action=group&union=0&sid=28704&gr=846&year=2025&vr=1",
        "aliases": [
            "кст-24-11-1",
            "Кст-24-11-1",
            "Кст-24-(11)-1",
            "КСт 24 11 1",
            "КСТ-24-(11)-1",
            "кст-24-(11)-1",
            "кст 24 11 1",
            "КСт-24-11-1",
            "Кст 24 11 1",
            "КСт-24-(11)-1",
            "КСТ 24 11 1",
            "КСТ-24-11-1"
        ],
        "department": "АиЭС",
        "specialty": "КСт"
    },
    "838": {
        "name": "МСр-24-(11)-1",
        "url": "https://coworking.tyuiu.ru/shs/aies_t/aies.php?action=group&union=0&sid=28704&gr=838&year=2025&vr=1",
        "aliases": [
            "МСР-24-11-1",
            "мср 24 11 1",
            "МСр-24-11-1",
            "Мср-24-(11)-1",
            "мср-24-11-1",
            "Мср 24 11 1",
            "МСр-24-(11)-1",
            "Мср-24-11-1",
            "МСР 24 11 1",
            "МСр 24 11 1",
            "мср-24-(11)-1",
            "МСР-24-(11)-1"
        ],
        "department": "АиЭС",
        "specialty": "МСр"
    },
    "724": {
        "name": "ОСр-22-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/aies_t/aies.php?action=group&union=0&sid=28704&gr=724&year=2025&vr=1",
        "aliases": [
            "оср 22 9 1",
            "ОСр-22-(9)-1",
            "оср-22-(9)-1",
            "ОСР 22 9 1",
            "Оср-22-(9)-1",
            "Оср-22-9-1",
            "оср-22-9-1",
            "ОСр-22-9-1",
            "ОСР-22-9-1",
            "Оср 22 9 1",
            "ОСР-22-(9)-1",
            "ОСр 22 9 1"
        ],
        "department": "АиЭС",
        "specialty": "ОСр"
    },
    "767": {
        "name": "ОСр-23-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/aies_t/aies.php?action=group&union=0&sid=28704&gr=767&year=2025&vr=1",
        "aliases": [
            "ОСр-23-(9)-1",
            "оср-23-(9)-1",
            "ОСр 23 9 1",
            "ОСр-23-9-1",
            "ОСР-23-(9)-1",
            "оср 23 9 1",
            "ОСР-23-9-1",
            "Оср-23-(9)-1",
            "ОСР 23 9 1",
            "Оср 23 9 1",
            "оср-23-9-1",
            "Оср-23-9-1"
        ],
        "department": "АиЭС",
        "specialty": "ОСр"
    },
    "839": {
        "name": "ОСр-24-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/aies_t/aies.php?action=group&union=0&sid=28704&gr=839&year=2025&vr=1",
        "aliases": [
            "ОСР-24-9-1",
            "ОСр 24 9 1",
            "ОСР 24 9 1",
            "ОСр-24-(9)-1",
            "Оср-24-9-1",
            "ОСР-24-(9)-1",
            "оср 24 9 1",
            "оср-24-9-1",
            "Оср 24 9 1",
            "Оср-24-(9)-1",
            "оср-24-(9)-1",
            "ОСр-24-9-1"
        ],
        "department": "АиЭС",
        "specialty": "ОСр"
    },
    "774": {
        "name": "ОТПт-23-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/aies_t/aies.php?action=group&union=0&sid=28704&gr=774&year=2025&vr=1",
        "aliases": [
            "ОТПт-23-(9)-1",
            "отпт-23-(9)-1",
            "Отпт-23-(9)-1",
            "ОТПТ-23-9-1",
            "ОТПТ-23-(9)-1",
            "Отпт 23 9 1",
            "ОТПт-23-9-1",
            "ОТПТ 23 9 1",
            "отпт 23 9 1",
            "отпт-23-9-1",
            "ОТПт 23 9 1",
            "Отпт-23-9-1"
        ],
        "department": "АиЭС",
        "specialty": "ОТПт"
    },
    "676": {
        "name": "РРТт-21-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/aies_t/aies.php?action=group&union=0&sid=28704&gr=676&year=2025&vr=1",
        "aliases": [
            "РРТт 21 9 1",
            "Рртт 21 9 1",
            "рртт-21-9-1",
            "РРТт-21-9-1",
            "РРТТ-21-9-1",
            "РРТТ-21-(9)-1",
            "Рртт-21-(9)-1",
            "рртт 21 9 1",
            "РРТТ 21 9 1",
            "рртт-21-(9)-1",
            "Рртт-21-9-1",
            "РРТт-21-(9)-1"
        ],
        "department": "АиЭС",
        "specialty": "РРТт"
    },
    "730": {
        "name": "РРТт-22-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/aies_t/aies.php?action=group&union=0&sid=28704&gr=730&year=2025&vr=1",
        "aliases": [
            "РРТТ-22-(9)-1",
            "рртт-22-(9)-1",
            "РРТт 22 9 1",
            "РРТт-22-9-1",
            "РРТТ-22-9-1",
            "рртт-22-9-1",
            "Рртт 22 9 1",
            "Рртт-22-(9)-1",
            "РРТТ 22 9 1",
            "рртт 22 9 1",
            "Рртт-22-9-1",
            "РРТт-22-(9)-1"
        ],
        "department": "АиЭС",
        "specialty": "РРТт"
    },
    "771": {
        "name": "СРТт-23-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/aies_t/aies.php?action=group&union=0&sid=28704&gr=771&year=2025&vr=1",
        "aliases": [
            "сртт-23-(9)-1",
            "СРТТ 23 9 1",
            "СРТТ-23-9-1",
            "СРТт-23-9-1",
            "Сртт-23-(9)-1",
            "СРТт 23 9 1",
            "СРТТ-23-(9)-1",
            "Сртт-23-9-1",
            "Сртт 23 9 1",
            "СРТт-23-(9)-1",
            "сртт 23 9 1",
            "сртт-23-9-1"
        ],
        "department": "АиЭС",
        "specialty": "СРТт"
    },
    "847": {
        "name": "СРТт-24-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/aies_t/aies.php?action=group&union=0&sid=28704&gr=847&year=2025&vr=1",
        "aliases": [
            "СРТТ-24-9-1",
            "Сртт-24-(9)-1",
            "СРТТ-24-(9)-1",
            "сртт-24-9-1",
            "СРТт-24-9-1",
            "Сртт-24-9-1",
            "СРТт 24 9 1",
            "сртт 24 9 1",
            "Сртт 24 9 1",
            "СРТТ 24 9 1",
            "сртт-24-(9)-1",
            "СРТт-24-(9)-1"
        ],
        "department": "АиЭС",
        "specialty": "СРТт"
    },
    "674": {
        "name": "ТЭОт-21-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/aies_t/aies.php?action=group&union=0&sid=28704&gr=674&year=2025&vr=1",
        "aliases": [
            "Тэот-21-9-1",
            "тэот 21 9 1",
            "ТЭОТ 21 9 1",
            "ТЭОт-21-(9)-1",
            "ТЭОт 21 9 1",
            "ТЭОТ-21-(9)-1",
            "тэот-21-9-1",
            "тэот-21-(9)-1",
            "ТЭОТ-21-9-1",
            "Тэот-21-(9)-1",
            "Тэот 21 9 1",
            "ТЭОт-21-9-1"
        ],
        "department": "АиЭС",
        "specialty": "ТЭОт"
    },
    "675": {
        "name": "ТЭОт-21-(9)-2",
        "url": "https://coworking.tyuiu.ru/shs/aies_t/aies.php?action=group&union=0&sid=28704&gr=675&year=2025&vr=1",
        "aliases": [
            "ТЭОт-21-(9)-2",
            "ТЭОТ 21 9 2",
            "тэот-21-(9)-2",
            "тэот-21-9-2",
            "ТЭОТ-21-9-2",
            "Тэот 21 9 2",
            "Тэот-21-(9)-2",
            "Тэот-21-9-2",
            "ТЭОт 21 9 2",
            "ТЭОт-21-9-2",
            "ТЭОТ-21-(9)-2",
            "тэот 21 9 2"
        ],
        "department": "АиЭС",
        "specialty": "ТЭОт"
    },
    "731": {
        "name": "ТЭОт-22-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/aies_t/aies.php?action=group&union=0&sid=28704&gr=731&year=2025&vr=1",
        "aliases": [
            "Тэот-22-9-1",
            "ТЭОт 22 9 1",
            "Тэот-22-(9)-1",
            "ТЭОТ 22 9 1",
            "Тэот 22 9 1",
            "тэот-22-(9)-1",
            "ТЭОт-22-9-1",
            "ТЭОТ-22-9-1",
            "ТЭОТ-22-(9)-1",
            "тэот 22 9 1",
            "тэот-22-9-1",
            "ТЭОт-22-(9)-1"
        ],
        "department": "АиЭС",
        "specialty": "ТЭОт"
    },
    "732": {
        "name": "ТЭОт-22-(9)-2",
        "url": "https://coworking.tyuiu.ru/shs/aies_t/aies.php?action=group&union=0&sid=28704&gr=732&year=2025&vr=1",
        "aliases": [
            "ТЭОТ 22 9 2",
            "ТЭОт 22 9 2",
            "тэот-22-(9)-2",
            "тэот-22-9-2",
            "Тэот 22 9 2",
            "ТЭОт-22-(9)-2",
            "Тэот-22-9-2",
            "ТЭОт-22-9-2",
            "ТЭОТ-22-9-2",
            "Тэот-22-(9)-2",
            "тэот 22 9 2",
            "ТЭОТ-22-(9)-2"
        ],
        "department": "АиЭС",
        "specialty": "ТЭОт"
    },
    "733": {
        "name": "ТЭОт-22-(11)-1",
        "url": "https://coworking.tyuiu.ru/shs/aies_t/aies.php?action=group&union=0&sid=28704&gr=733&year=2025&vr=1",
        "aliases": [
            "Тэот-22-(11)-1",
            "тэот-22-(11)-1",
            "тэот-22-11-1",
            "ТЭОТ-22-(11)-1",
            "ТЭОт-22-11-1",
            "Тэот 22 11 1",
            "ТЭОт 22 11 1",
            "ТЭОТ-22-11-1",
            "ТЭОт-22-(11)-1",
            "тэот 22 11 1",
            "Тэот-22-11-1",
            "ТЭОТ 22 11 1"
        ],
        "department": "АиЭС",
        "specialty": "ТЭОт"
    },
    "772": {
        "name": "ТЭОт-23-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/aies_t/aies.php?action=group&union=0&sid=28704&gr=772&year=2025&vr=1",
        "aliases": [
            "Тэот-23-(9)-1",
            "ТЭОт-23-(9)-1",
            "ТЭОТ-23-9-1",
            "ТЭОТ 23 9 1",
            "ТЭОТ-23-(9)-1",
            "ТЭОт-23-9-1",
            "Тэот 23 9 1",
            "Тэот-23-9-1",
            "тэот 23 9 1",
            "тэот-23-(9)-1",
            "ТЭОт 23 9 1",
            "тэот-23-9-1"
        ],
        "department": "АиЭС",
        "specialty": "ТЭОт"
    },
    "773": {
        "name": "ТЭОт-23-(9)-2",
        "url": "https://coworking.tyuiu.ru/shs/aies_t/aies.php?action=group&union=0&sid=28704&gr=773&year=2025&vr=1",
        "aliases": [
            "ТЭОТ 23 9 2",
            "ТЭОТ-23-(9)-2",
            "тэот-23-(9)-2",
            "ТЭОт-23-9-2",
            "Тэот-23-(9)-2",
            "ТЭОт 23 9 2",
            "ТЭОт-23-(9)-2",
            "тэот-23-9-2",
            "тэот 23 9 2",
            "ТЭОТ-23-9-2",
            "Тэот-23-9-2",
            "Тэот 23 9 2"
        ],
        "department": "АиЭС",
        "specialty": "ТЭОт"
    },
    "776": {
        "name": "ТЭОт-23-(11)-1",
        "url": "https://coworking.tyuiu.ru/shs/aies_t/aies.php?action=group&union=0&sid=28704&gr=776&year=2025&vr=1",
        "aliases": [
            "Тэот 23 11 1",
            "тэот-23-11-1",
            "ТЭОТ-23-11-1",
            "Тэот-23-(11)-1",
            "ТЭОт-23-(11)-1",
            "ТЭОт 23 11 1",
            "ТЭОТ 23 11 1",
            "тэот-23-(11)-1",
            "ТЭОт-23-11-1",
            "тэот 23 11 1",
            "Тэот-23-11-1",
            "ТЭОТ-23-(11)-1"
        ],
        "department": "АиЭС",
        "specialty": "ТЭОт"
    },
    "848": {
        "name": "ЭОт-24-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/aies_t/aies.php?action=group&union=0&sid=28704&gr=848&year=2025&vr=1",
        "aliases": [
            "ЭОт 24 9 1",
            "эот-24-(9)-1",
            "ЭОт-24-(9)-1",
            "ЭОТ-24-(9)-1",
            "эот-24-9-1",
            "ЭОТ-24-9-1",
            "Эот-24-(9)-1",
            "Эот 24 9 1",
            "ЭОТ 24 9 1",
            "ЭОт-24-9-1",
            "Эот-24-9-1",
            "эот 24 9 1"
        ],
        "department": "АиЭС",
        "specialty": "ЭОт"
    },
    "849": {
        "name": "ЭОт-24-(9)-2",
        "url": "https://coworking.tyuiu.ru/shs/aies_t/aies.php?action=group&union=0&sid=28704&gr=849&year=2025&vr=1",
        "aliases": [
            "ЭОт 24 9 2",
            "Эот 24 9 2",
            "ЭОТ 24 9 2",
            "Эот-24-9-2",
            "эот-24-9-2",
            "эот 24 9 2",
            "ЭОТ-24-(9)-2",
            "ЭОТ-24-9-2",
            "ЭОт-24-9-2",
            "ЭОт-24-(9)-2",
            "эот-24-(9)-2",
            "Эот-24-(9)-2"
        ],
        "department": "АиЭС",
        "specialty": "ЭОт"
    },
    "850": {
        "name": "ЭОт-24-(11)-1",
        "url": "https://coworking.tyuiu.ru/shs/aies_t/aies.php?action=group&union=0&sid=28704&gr=850&year=2025&vr=1",
        "aliases": [
            "ЭОт-24-11-1",
            "Эот-24-(11)-1",
            "ЭОт 24 11 1",
            "Эот 24 11 1",
            "эот-24-11-1",
            "эот-24-(11)-1",
            "ЭОТ-24-11-1",
            "ЭОт-24-(11)-1",
            "эот 24 11 1",
            "Эот-24-11-1",
            "ЭОТ-24-(11)-1",
            "ЭОТ 24 11 1"
        ],
        "department": "АиЭС",
        "specialty": "ЭОт"
    },
    "725": {
        "name": "ЭРЭр-22-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/aies_t/aies.php?action=group&union=0&sid=28704&gr=725&year=2025&vr=1",
        "aliases": [
            "ЭРЭР-22-(9)-1",
            "Эрэр 22 9 1",
            "ЭРЭР-22-9-1",
            "ЭРЭр 22 9 1",
            "ЭРЭр-22-(9)-1",
            "Эрэр-22-9-1",
            "ЭРЭр-22-9-1",
            "эрэр-22-(9)-1",
            "ЭРЭР 22 9 1",
            "Эрэр-22-(9)-1",
            "эрэр-22-9-1",
            "эрэр 22 9 1"
        ],
        "department": "АиЭС",
        "specialty": "ЭРЭр"
    },
    "766": {
        "name": "ЭРЭр-23-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/aies_t/aies.php?action=group&union=0&sid=28704&gr=766&year=2025&vr=1",
        "aliases": [
            "ЭРЭР 23 9 1",
            "эрэр-23-9-1",
            "Эрэр-23-(9)-1",
            "Эрэр-23-9-1",
            "эрэр-23-(9)-1",
            "ЭРЭр-23-(9)-1",
            "ЭРЭР-23-(9)-1",
            "ЭРЭр-23-9-1",
            "Эрэр 23 9 1",
            "ЭРЭр 23 9 1",
            "ЭРЭР-23-9-1",
            "эрэр 23 9 1"
        ],
        "department": "АиЭС",
        "specialty": "ЭРЭр"
    },
    "840": {
        "name": "ЭРЭр-24-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/aies_t/aies.php?action=group&union=0&sid=28704&gr=840&year=2025&vr=1",
        "aliases": [
            "ЭРЭр-24-(9)-1",
            "эрэр-24-(9)-1",
            "Эрэр-24-9-1",
            "ЭРЭр-24-9-1",
            "ЭРЭР-24-9-1",
            "ЭРЭР 24 9 1",
            "Эрэр-24-(9)-1",
            "Эрэр 24 9 1",
            "ЭРЭр 24 9 1",
            "эрэр-24-9-1",
            "ЭРЭР-24-(9)-1",
            "эрэр 24 9 1"
        ],
        "department": "АиЭС",
        "specialty": "ЭРЭр"
    },
    "841": {
        "name": "ЭРЭр-24-(11)-1",
        "url": "https://coworking.tyuiu.ru/shs/aies_t/aies.php?action=group&union=0&sid=28704&gr=841&year=2025&vr=1",
        "aliases": [
            "эрэр-24-(11)-1",
            "ЭРЭР 24 11 1",
            "ЭРЭР-24-11-1",
            "Эрэр 24 11 1",
            "Эрэр-24-11-1",
            "Эрэр-24-(11)-1",
            "эрэр 24 11 1",
            "эрэр-24-11-1",
            "ЭРЭр-24-(11)-1",
            "ЭРЭР-24-(11)-1",
            "ЭРЭр-24-11-1",
            "ЭРЭр 24 11 1"
        ],
        "department": "АиЭС",
        "specialty": "ЭРЭр"
    },
    "837": {
        "name": "ЭСр-24-(11)-1",
        "url": "https://coworking.tyuiu.ru/shs/aies_t/aies.php?action=group&union=0&sid=28704&gr=837&year=2025&vr=1",
        "aliases": [
            "эср 24 11 1",
            "ЭСр-24-11-1",
            "ЭСР-24-(11)-1",
            "Эср-24-11-1",
            "эср-24-(11)-1",
            "ЭСР 24 11 1",
            "ЭСр 24 11 1",
            "Эср-24-(11)-1",
            "эср-24-11-1",
            "ЭСр-24-(11)-1",
            "Эср 24 11 1",
            "ЭСР-24-11-1"
        ],
        "department": "АиЭС",
        "specialty": "ЭСр"
    }
}

def get_group_by_name(name):
    ... # см. оригинальную функцию
