def make_aliases(name):
    ... # см. оригинальную функцию

GROUPS_FULL = {
    "686": {
        "name": "БСр-22-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/ngo_t/ngo.php?action=group&union=0&sid=28703&gr=686&year=2025&vr=1",
        "aliases": [
            "БСр-22-9-1",
            "БСР-22-9-1",
            "БСР-22-(9)-1",
            "бср-22-(9)-1",
            "бср 22 9 1",
            "БСр 22 9 1",
            "Бср-22-9-1",
            "БСр-22-(9)-1",
            "Бср-22-(9)-1",
            "БСР 22 9 1",
            "Бср 22 9 1",
            "бср-22-9-1"
        ],
        "department": "НГО",
        "specialty": "БСр"
    },
    "758": {
        "name": "БСр-23-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/ngo_t/ngo.php?action=group&union=0&sid=28703&gr=758&year=2025&vr=1",
        "aliases": [
            "бср 23 9 1",
            "БСР-23-9-1",
            "бср-23-9-1",
            "Бср 23 9 1",
            "БСР 23 9 1",
            "БСр-23-9-1",
            "БСр-23-(9)-1",
            "Бср-23-(9)-1",
            "бср-23-(9)-1",
            "БСР-23-(9)-1",
            "Бср-23-9-1",
            "БСр 23 9 1"
        ],
        "department": "НГО",
        "specialty": "БСр"
    },
    "752": {
        "name": "БСр-23-(11)-1",
        "url": "https://coworking.tyuiu.ru/shs/ngo_t/ngo.php?action=group&union=0&sid=28703&gr=752&year=2025&vr=1",
        "aliases": [
            "БСр-23-11-1",
            "бср-23-11-1",
            "Бср 23 11 1",
            "БСР-23-(11)-1",
            "БСр-23-(11)-1",
            "бср-23-(11)-1",
            "Бср-23-11-1",
            "БСР 23 11 1",
            "БСР-23-11-1",
            "БСр 23 11 1",
            "Бср-23-(11)-1",
            "бср 23 11 1"
        ],
        "department": "НГО",
        "specialty": "БСр"
    },
    "868": {
        "name": "БСр-24-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/ngo_t/ngo.php?action=group&union=0&sid=28703&gr=868&year=2025&vr=1",
        "aliases": [
            "БСр 24 9 1",
            "БСР-24-9-1",
            "бср 24 9 1",
            "бср-24-9-1",
            "бср-24-(9)-1",
            "БСр-24-(9)-1",
            "БСр-24-9-1",
            "Бср-24-(9)-1",
            "Бср 24 9 1",
            "Бср-24-9-1",
            "БСР 24 9 1",
            "БСР-24-(9)-1"
        ],
        "department": "НГО",
        "specialty": "БСр"
    },
    "869": {
        "name": "БСр-24-(11)-1",
        "url": "https://coworking.tyuiu.ru/shs/ngo_t/ngo.php?action=group&union=0&sid=28703&gr=869&year=2025&vr=1",
        "aliases": [
            "Бср-24-11-1",
            "Бср 24 11 1",
            "Бср-24-(11)-1",
            "бср-24-11-1",
            "БСР-24-(11)-1",
            "БСР 24 11 1",
            "БСр-24-11-1",
            "БСр 24 11 1",
            "БСР-24-11-1",
            "БСр-24-(11)-1",
            "бср-24-(11)-1",
            "бср 24 11 1"
        ],
        "department": "НГО",
        "specialty": "БСр"
    },
    "661": {
        "name": "БСт-21-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/ngo_t/ngo.php?action=group&union=0&sid=28703&gr=661&year=2025&vr=1",
        "aliases": [
            "БСТ 21 9 1",
            "БСТ-21-9-1",
            "бст-21-(9)-1",
            "БСт 21 9 1",
            "Бст 21 9 1",
            "бст-21-9-1",
            "бст 21 9 1",
            "Бст-21-9-1",
            "БСт-21-(9)-1",
            "БСт-21-9-1",
            "Бст-21-(9)-1",
            "БСТ-21-(9)-1"
        ],
        "department": "НГО",
        "specialty": "БСт"
    },
    "692": {
        "name": "БСт-22-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/ngo_t/ngo.php?action=group&union=0&sid=28703&gr=692&year=2025&vr=1",
        "aliases": [
            "БСт-22-(9)-1",
            "БСт-22-9-1",
            "Бст-22-9-1",
            "бст 22 9 1",
            "бст-22-(9)-1",
            "бст-22-9-1",
            "БСТ-22-9-1",
            "Бст-22-(9)-1",
            "БСТ 22 9 1",
            "БСт 22 9 1",
            "БСТ-22-(9)-1",
            "Бст 22 9 1"
        ],
        "department": "НГО",
        "specialty": "БСт"
    },
    "691": {
        "name": "БСт-22-(11)-1",
        "url": "https://coworking.tyuiu.ru/shs/ngo_t/ngo.php?action=group&union=0&sid=28703&gr=691&year=2025&vr=1",
        "aliases": [
            "БСт-22-11-1",
            "Бст-22-(11)-1",
            "БСт-22-(11)-1",
            "БСт 22 11 1",
            "БСТ-22-11-1",
            "бст-22-11-1",
            "БСТ-22-(11)-1",
            "БСТ 22 11 1",
            "бст 22 11 1",
            "Бст-22-11-1",
            "бст-22-(11)-1",
            "Бст 22 11 1"
        ],
        "department": "НГО",
        "specialty": "БСт"
    },
    "755": {
        "name": "БСт-23-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/ngo_t/ngo.php?action=group&union=0&sid=28703&gr=755&year=2025&vr=1",
        "aliases": [
            "БСт-23-9-1",
            "БСТ-23-9-1",
            "бст-23-9-1",
            "БСТ 23 9 1",
            "бст-23-(9)-1",
            "БСТ-23-(9)-1",
            "бст 23 9 1",
            "Бст-23-9-1",
            "Бст-23-(9)-1",
            "Бст 23 9 1",
            "БСт 23 9 1",
            "БСт-23-(9)-1"
        ],
        "department": "НГО",
        "specialty": "БСт"
    },
    "748": {
        "name": "БСт-23-(11)-1",
        "url": "https://coworking.tyuiu.ru/shs/ngo_t/ngo.php?action=group&union=0&sid=28703&gr=748&year=2025&vr=1",
        "aliases": [
            "бст-23-11-1",
            "Бст-23-(11)-1",
            "БСт-23-11-1",
            "БСТ-23-11-1",
            "БСт 23 11 1",
            "БСТ-23-(11)-1",
            "Бст 23 11 1",
            "Бст-23-11-1",
            "бст 23 11 1",
            "БСТ 23 11 1",
            "бст-23-(11)-1",
            "БСт-23-(11)-1"
        ],
        "department": "НГО",
        "specialty": "БСт"
    },
    "877": {
        "name": "БСт-24-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/ngo_t/ngo.php?action=group&union=0&sid=28703&gr=877&year=2025&vr=1",
        "aliases": [
            "Бст-24-(9)-1",
            "БСт 24 9 1",
            "бст 24 9 1",
            "БСт-24-(9)-1",
            "БСТ-24-9-1",
            "Бст 24 9 1",
            "БСТ 24 9 1",
            "бст-24-9-1",
            "БСт-24-9-1",
            "бст-24-(9)-1",
            "Бст-24-9-1",
            "БСТ-24-(9)-1"
        ],
        "department": "НГО",
        "specialty": "БСт"
    },
    "878": {
        "name": "БСт-24-(11)-1",
        "url": "https://coworking.tyuiu.ru/shs/ngo_t/ngo.php?action=group&union=0&sid=28703&gr=878&year=2025&vr=1",
        "aliases": [
            "БСТ 24 11 1",
            "Бст 24 11 1",
            "БСт-24-11-1",
            "БСТ-24-11-1",
            "бст 24 11 1",
            "БСт 24 11 1",
            "Бст-24-(11)-1",
            "Бст-24-11-1",
            "бст-24-(11)-1",
            "БСт-24-(11)-1",
            "бст-24-11-1",
            "БСТ-24-(11)-1"
        ],
        "department": "НГО",
        "specialty": "БСт"
    },
    "879": {
        "name": "БСт-24-(11)-2",
        "url": "https://coworking.tyuiu.ru/shs/ngo_t/ngo.php?action=group&union=0&sid=28703&gr=879&year=2025&vr=1",
        "aliases": [
            "бст-24-(11)-2",
            "Бст 24 11 2",
            "Бст-24-11-2",
            "БСТ-24-(11)-2",
            "БСт-24-11-2",
            "БСт-24-(11)-2",
            "бст 24 11 2",
            "БСт 24 11 2",
            "БСТ-24-11-2",
            "БСТ 24 11 2",
            "бст-24-11-2",
            "Бст-24-(11)-2"
        ],
        "department": "НГО",
        "specialty": "БСт"
    },
    "698": {
        "name": "ГНГт-22-(11)-1",
        "url": "https://coworking.tyuiu.ru/shs/ngo_t/ngo.php?action=group&union=0&sid=28703&gr=698&year=2025&vr=1",
        "aliases": [
            "ГНГт 22 11 1",
            "ГНГТ 22 11 1",
            "гнгт 22 11 1",
            "ГНГТ-22-(11)-1",
            "ГНГт-22-(11)-1",
            "Гнгт 22 11 1",
            "ГНГТ-22-11-1",
            "ГНГт-22-11-1",
            "Гнгт-22-11-1",
            "Гнгт-22-(11)-1",
            "гнгт-22-11-1",
            "гнгт-22-(11)-1"
        ],
        "department": "НГО",
        "specialty": "ГНГт"
    },
    "749": {
        "name": "ГНГт-23-(11)-1",
        "url": "https://coworking.tyuiu.ru/shs/ngo_t/ngo.php?action=group&union=0&sid=28703&gr=749&year=2025&vr=1",
        "aliases": [
            "гнгт 23 11 1",
            "Гнгт 23 11 1",
            "ГНГт-23-11-1",
            "ГНГт 23 11 1",
            "ГНГТ 23 11 1",
            "ГНГТ-23-11-1",
            "гнгт-23-11-1",
            "Гнгт-23-11-1",
            "ГНГТ-23-(11)-1",
            "Гнгт-23-(11)-1",
            "гнгт-23-(11)-1",
            "ГНГт-23-(11)-1"
        ],
        "department": "НГО",
        "specialty": "ГНГт"
    },
    "880": {
        "name": "ГНГт-24-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/ngo_t/ngo.php?action=group&union=0&sid=28703&gr=880&year=2025&vr=1",
        "aliases": [
            "ГНГТ-24-(9)-1",
            "ГНГТ 24 9 1",
            "ГНГт-24-9-1",
            "гнгт-24-9-1",
            "Гнгт 24 9 1",
            "Гнгт-24-9-1",
            "ГНГт 24 9 1",
            "Гнгт-24-(9)-1",
            "ГНГТ-24-9-1",
            "ГНГт-24-(9)-1",
            "гнгт 24 9 1",
            "гнгт-24-(9)-1"
        ],
        "department": "НГО",
        "specialty": "ГНГт"
    },
    "881": {
        "name": "ГНГт-24-(11)-1",
        "url": "https://coworking.tyuiu.ru/shs/ngo_t/ngo.php?action=group&union=0&sid=28703&gr=881&year=2025&vr=1",
        "aliases": [
            "ГНГТ-24-(11)-1",
            "ГНГТ 24 11 1",
            "ГНГт-24-11-1",
            "Гнгт 24 11 1",
            "гнгт 24 11 1",
            "ГНГт 24 11 1",
            "гнгт-24-11-1",
            "Гнгт-24-(11)-1",
            "ГНГТ-24-11-1",
            "Гнгт-24-11-1",
            "ГНГт-24-(11)-1",
            "гнгт-24-(11)-1"
        ],
        "department": "НГО",
        "specialty": "ГНГт"
    },
    "687": {
        "name": "МБр-22-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/ngo_t/ngo.php?action=group&union=0&sid=28703&gr=687&year=2025&vr=1",
        "aliases": [
            "Мбр-22-(9)-1",
            "МБР-22-(9)-1",
            "мбр 22 9 1",
            "мбр-22-(9)-1",
            "МБр-22-9-1",
            "МБР-22-9-1",
            "МБР 22 9 1",
            "Мбр-22-9-1",
            "МБр 22 9 1",
            "Мбр 22 9 1",
            "мбр-22-9-1",
            "МБр-22-(9)-1"
        ],
        "department": "НГО",
        "specialty": "МБр"
    },
    "759": {
        "name": "МБр-23-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/ngo_t/ngo.php?action=group&union=0&sid=28703&gr=759&year=2025&vr=1",
        "aliases": [
            "Мбр-23-9-1",
            "МБР 23 9 1",
            "МБр-23-(9)-1",
            "МБР-23-(9)-1",
            "мбр-23-(9)-1",
            "мбр-23-9-1",
            "МБр 23 9 1",
            "МБР-23-9-1",
            "Мбр 23 9 1",
            "Мбр-23-(9)-1",
            "мбр 23 9 1",
            "МБр-23-9-1"
        ],
        "department": "НГО",
        "specialty": "МБр"
    },
    "870": {
        "name": "МБр-24-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/ngo_t/ngo.php?action=group&union=0&sid=28703&gr=870&year=2025&vr=1",
        "aliases": [
            "мбр 24 9 1",
            "мбр-24-9-1",
            "Мбр 24 9 1",
            "МБр 24 9 1",
            "МБр-24-(9)-1",
            "МБР 24 9 1",
            "мбр-24-(9)-1",
            "МБР-24-(9)-1",
            "МБр-24-9-1",
            "Мбр-24-(9)-1",
            "Мбр-24-9-1",
            "МБР-24-9-1"
        ],
        "department": "НГО",
        "specialty": "МБр"
    },
    "871": {
        "name": "МБр-24-(11)-1",
        "url": "https://coworking.tyuiu.ru/shs/ngo_t/ngo.php?action=group&union=0&sid=28703&gr=871&year=2025&vr=1",
        "aliases": [
            "мбр 24 11 1",
            "МБр-24-(11)-1",
            "мбр-24-(11)-1",
            "Мбр 24 11 1",
            "МБр 24 11 1",
            "мбр-24-11-1",
            "Мбр-24-11-1",
            "МБР-24-(11)-1",
            "МБР-24-11-1",
            "МБр-24-11-1",
            "Мбр-24-(11)-1",
            "МБР 24 11 1"
        ],
        "department": "НГО",
        "specialty": "МБр"
    },
    "688": {
        "name": "МТНр-22-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/ngo_t/ngo.php?action=group&union=0&sid=28703&gr=688&year=2025&vr=1",
        "aliases": [
            "МТНр-22-(9)-1",
            "МТНР 22 9 1",
            "мтнр-22-9-1",
            "Мтнр-22-(9)-1",
            "Мтнр-22-9-1",
            "МТНР-22-(9)-1",
            "МТНР-22-9-1",
            "мтнр-22-(9)-1",
            "МТНр 22 9 1",
            "МТНр-22-9-1",
            "мтнр 22 9 1",
            "Мтнр 22 9 1"
        ],
        "department": "НГО",
        "specialty": "МТНр"
    },
    "760": {
        "name": "МТНр-23-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/ngo_t/ngo.php?action=group&union=0&sid=28703&gr=760&year=2025&vr=1",
        "aliases": [
            "МТНР-23-(9)-1",
            "МТНр-23-(9)-1",
            "МТНр-23-9-1",
            "МТНР-23-9-1",
            "Мтнр-23-9-1",
            "Мтнр-23-(9)-1",
            "мтнр 23 9 1",
            "мтнр-23-(9)-1",
            "МТНР 23 9 1",
            "МТНр 23 9 1",
            "мтнр-23-9-1",
            "Мтнр 23 9 1"
        ],
        "department": "НГО",
        "specialty": "МТНр"
    },
    "864": {
        "name": "МТНр-24-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/ngo_t/ngo.php?action=group&union=0&sid=28703&gr=864&year=2025&vr=1",
        "aliases": [
            "МТНР-24-(9)-1",
            "мтнр 24 9 1",
            "мтнр-24-(9)-1",
            "Мтнр 24 9 1",
            "МТНр-24-9-1",
            "МТНр 24 9 1",
            "мтнр-24-9-1",
            "Мтнр-24-(9)-1",
            "МТНр-24-(9)-1",
            "Мтнр-24-9-1",
            "МТНР 24 9 1",
            "МТНР-24-9-1"
        ],
        "department": "НГО",
        "specialty": "МТНр"
    },
    "865": {
        "name": "МТНр-24-(11)-1",
        "url": "https://coworking.tyuiu.ru/shs/ngo_t/ngo.php?action=group&union=0&sid=28703&gr=865&year=2025&vr=1",
        "aliases": [
            "МТНр-24-(11)-1",
            "МТНР-24-11-1",
            "мтнр 24 11 1",
            "МТНр-24-11-1",
            "Мтнр 24 11 1",
            "МТНР-24-(11)-1",
            "мтнр-24-11-1",
            "мтнр-24-(11)-1",
            "Мтнр-24-(11)-1",
            "МТНр 24 11 1",
            "МТНР 24 11 1",
            "Мтнр-24-11-1"
        ],
        "department": "НГО",
        "specialty": "МТНр"
    },
    "689": {
        "name": "НГСр-22-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/ngo_t/ngo.php?action=group&union=0&sid=28703&gr=689&year=2025&vr=1",
        "aliases": [
            "Нгср-22-(9)-1",
            "Нгср 22 9 1",
            "НГСР-22-9-1",
            "НГСР 22 9 1",
            "нгср 22 9 1",
            "нгср-22-9-1",
            "НГСр 22 9 1",
            "НГСр-22-9-1",
            "нгср-22-(9)-1",
            "Нгср-22-9-1",
            "НГСР-22-(9)-1",
            "НГСр-22-(9)-1"
        ],
        "department": "НГО",
        "specialty": "НГСр"
    },
    "761": {
        "name": "НГСр-23-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/ngo_t/ngo.php?action=group&union=0&sid=28703&gr=761&year=2025&vr=1",
        "aliases": [
            "НГСр-23-(9)-1",
            "НГСР-23-9-1",
            "нгср 23 9 1",
            "Нгср-23-9-1",
            "Нгср 23 9 1",
            "НГСР 23 9 1",
            "НГСр-23-9-1",
            "нгср-23-(9)-1",
            "НГСР-23-(9)-1",
            "нгср-23-9-1",
            "НГСр 23 9 1",
            "Нгср-23-(9)-1"
        ],
        "department": "НГО",
        "specialty": "НГСр"
    },
    "866": {
        "name": "НГСр-24-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/ngo_t/ngo.php?action=group&union=0&sid=28703&gr=866&year=2025&vr=1",
        "aliases": [
            "НГСр-24-(9)-1",
            "НГСР 24 9 1",
            "Нгср-24-(9)-1",
            "НГСР-24-9-1",
            "нгср 24 9 1",
            "НГСр-24-9-1",
            "НГСр 24 9 1",
            "Нгср 24 9 1",
            "Нгср-24-9-1",
            "нгср-24-(9)-1",
            "нгср-24-9-1",
            "НГСР-24-(9)-1"
        ],
        "department": "НГО",
        "specialty": "НГСр"
    },
    "657": {
        "name": "НРт-21-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/ngo_t/ngo.php?action=group&union=0&sid=28703&gr=657&year=2025&vr=1",
        "aliases": [
            "НРт-21-(9)-1",
            "НРТ-21-(9)-1",
            "Нрт 21 9 1",
            "НРТ-21-9-1",
            "НРт 21 9 1",
            "нрт 21 9 1",
            "Нрт-21-9-1",
            "НРт-21-9-1",
            "НРТ 21 9 1",
            "нрт-21-(9)-1",
            "Нрт-21-(9)-1",
            "нрт-21-9-1"
        ],
        "department": "НГО",
        "specialty": "НРт"
    },
    "658": {
        "name": "НРт-21-(9)-2",
        "url": "https://coworking.tyuiu.ru/shs/ngo_t/ngo.php?action=group&union=0&sid=28703&gr=658&year=2025&vr=1",
        "aliases": [
            "НРт-21-9-2",
            "НРТ-21-9-2",
            "нрт-21-(9)-2",
            "НРт 21 9 2",
            "НРТ-21-(9)-2",
            "Нрт 21 9 2",
            "НРТ 21 9 2",
            "НРт-21-(9)-2",
            "нрт 21 9 2",
            "Нрт-21-9-2",
            "Нрт-21-(9)-2",
            "нрт-21-9-2"
        ],
        "department": "НГО",
        "specialty": "НРт"
    },
    "695": {
        "name": "НРт-22-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/ngo_t/ngo.php?action=group&union=0&sid=28703&gr=695&year=2025&vr=1",
        "aliases": [
            "НРТ 22 9 1",
            "НРт 22 9 1",
            "Нрт 22 9 1",
            "нрт 22 9 1",
            "НРТ-22-9-1",
            "НРт-22-(9)-1",
            "Нрт-22-(9)-1",
            "Нрт-22-9-1",
            "нрт-22-9-1",
            "НРТ-22-(9)-1",
            "НРт-22-9-1",
            "нрт-22-(9)-1"
        ],
        "department": "НГО",
        "specialty": "НРт"
    },
    "696": {
        "name": "НРт-22-(9)-2",
        "url": "https://coworking.tyuiu.ru/shs/ngo_t/ngo.php?action=group&union=0&sid=28703&gr=696&year=2025&vr=1",
        "aliases": [
            "НРт 22 9 2",
            "Нрт-22-(9)-2",
            "нрт-22-9-2",
            "НРТ 22 9 2",
            "НРт-22-9-2",
            "нрт-22-(9)-2",
            "НРт-22-(9)-2",
            "нрт 22 9 2",
            "Нрт 22 9 2",
            "Нрт-22-9-2",
            "НРТ-22-(9)-2",
            "НРТ-22-9-2"
        ],
        "department": "НГО",
        "specialty": "НРт"
    },
    "697": {
        "name": "НРт-22-(9)-3",
        "url": "https://coworking.tyuiu.ru/shs/ngo_t/ngo.php?action=group&union=0&sid=28703&gr=697&year=2025&vr=1",
        "aliases": [
            "НРт 22 9 3",
            "НРТ 22 9 3",
            "НРт-22-(9)-3",
            "нрт-22-9-3",
            "нрт 22 9 3",
            "НРТ-22-9-3",
            "НРт-22-9-3",
            "Нрт 22 9 3",
            "Нрт-22-9-3",
            "Нрт-22-(9)-3",
            "нрт-22-(9)-3",
            "НРТ-22-(9)-3"
        ],
        "department": "НГО",
        "specialty": "НРт"
    },
    "745": {
        "name": "НРт-22-(9)-4",
        "url": "https://coworking.tyuiu.ru/shs/ngo_t/ngo.php?action=group&union=0&sid=28703&gr=745&year=2025&vr=1",
        "aliases": [
            "нрт-22-9-4",
            "НРТ 22 9 4",
            "Нрт-22-9-4",
            "НРт-22-(9)-4",
            "НРТ-22-(9)-4",
            "Нрт 22 9 4",
            "НРт-22-9-4",
            "НРТ-22-9-4",
            "нрт-22-(9)-4",
            "Нрт-22-(9)-4",
            "НРт 22 9 4",
            "нрт 22 9 4"
        ],
        "department": "НГО",
        "specialty": "НРт"
    },
    "693": {
        "name": "НРт-22-(11)-1",
        "url": "https://coworking.tyuiu.ru/shs/ngo_t/ngo.php?action=group&union=0&sid=28703&gr=693&year=2025&vr=1",
        "aliases": [
            "Нрт-22-11-1",
            "НРт 22 11 1",
            "НРТ-22-11-1",
            "НРТ-22-(11)-1",
            "НРт-22-(11)-1",
            "нрт 22 11 1",
            "Нрт-22-(11)-1",
            "Нрт 22 11 1",
            "НРт-22-11-1",
            "нрт-22-11-1",
            "НРТ 22 11 1",
            "нрт-22-(11)-1"
        ],
        "department": "НГО",
        "specialty": "НРт"
    },
    "694": {
        "name": "НРт-22-(11)-2",
        "url": "https://coworking.tyuiu.ru/shs/ngo_t/ngo.php?action=group&union=0&sid=28703&gr=694&year=2025&vr=1",
        "aliases": [
            "нрт 22 11 2",
            "НРт-22-11-2",
            "НРТ 22 11 2",
            "Нрт-22-(11)-2",
            "НРТ-22-11-2",
            "НРт 22 11 2",
            "Нрт 22 11 2",
            "НРт-22-(11)-2",
            "НРТ-22-(11)-2",
            "нрт-22-11-2",
            "Нрт-22-11-2",
            "нрт-22-(11)-2"
        ],
        "department": "НГО",
        "specialty": "НРт"
    },
    "756": {
        "name": "НРт-23-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/ngo_t/ngo.php?action=group&union=0&sid=28703&gr=756&year=2025&vr=1",
        "aliases": [
            "Нрт 23 9 1",
            "НРТ-23-9-1",
            "НРт-23-(9)-1",
            "НРт 23 9 1",
            "нрт-23-9-1",
            "нрт 23 9 1",
            "НРт-23-9-1",
            "нрт-23-(9)-1",
            "НРТ 23 9 1",
            "НРТ-23-(9)-1",
            "Нрт-23-(9)-1",
            "Нрт-23-9-1"
        ],
        "department": "НГО",
        "specialty": "НРт"
    },
    "757": {
        "name": "НРт-23-(9)-2",
        "url": "https://coworking.tyuiu.ru/shs/ngo_t/ngo.php?action=group&union=0&sid=28703&gr=757&year=2025&vr=1",
        "aliases": [
            "Нрт-23-(9)-2",
            "Нрт-23-9-2",
            "нрт-23-9-2",
            "нрт-23-(9)-2",
            "НРТ 23 9 2",
            "НРТ-23-(9)-2",
            "НРТ-23-9-2",
            "НРт-23-(9)-2",
            "нрт 23 9 2",
            "НРт-23-9-2",
            "НРт 23 9 2",
            "Нрт 23 9 2"
        ],
        "department": "НГО",
        "specialty": "НРт"
    },
    "750": {
        "name": "НРт-23-(11)-1",
        "url": "https://coworking.tyuiu.ru/shs/ngo_t/ngo.php?action=group&union=0&sid=28703&gr=750&year=2025&vr=1",
        "aliases": [
            "НРТ-23-11-1",
            "НРт 23 11 1",
            "нрт-23-(11)-1",
            "Нрт-23-11-1",
            "НРТ-23-(11)-1",
            "НРт-23-11-1",
            "нрт-23-11-1",
            "Нрт 23 11 1",
            "НРт-23-(11)-1",
            "нрт 23 11 1",
            "НРТ 23 11 1",
            "Нрт-23-(11)-1"
        ],
        "department": "НГО",
        "specialty": "НРт"
    },
    "751": {
        "name": "НРт-23-(11)-2",
        "url": "https://coworking.tyuiu.ru/shs/ngo_t/ngo.php?action=group&union=0&sid=28703&gr=751&year=2025&vr=1",
        "aliases": [
            "НРт-23-11-2",
            "нрт-23-11-2",
            "Нрт 23 11 2",
            "нрт 23 11 2",
            "НРТ 23 11 2",
            "НРт-23-(11)-2",
            "НРТ-23-(11)-2",
            "Нрт-23-11-2",
            "НРТ-23-11-2",
            "Нрт-23-(11)-2",
            "НРт 23 11 2",
            "нрт-23-(11)-2"
        ],
        "department": "НГО",
        "specialty": "НРт"
    },
    "872": {
        "name": "НРт-24-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/ngo_t/ngo.php?action=group&union=0&sid=28703&gr=872&year=2025&vr=1",
        "aliases": [
            "НРТ-24-(9)-1",
            "НРТ-24-9-1",
            "НРт-24-(9)-1",
            "нрт 24 9 1",
            "НРт-24-9-1",
            "Нрт-24-9-1",
            "НРт 24 9 1",
            "нрт-24-9-1",
            "Нрт-24-(9)-1",
            "НРТ 24 9 1",
            "Нрт 24 9 1",
            "нрт-24-(9)-1"
        ],
        "department": "НГО",
        "specialty": "НРт"
    },
    "873": {
        "name": "НРт-24-(9)-2",
        "url": "https://coworking.tyuiu.ru/shs/ngo_t/ngo.php?action=group&union=0&sid=28703&gr=873&year=2025&vr=1",
        "aliases": [
            "НРТ 24 9 2",
            "нрт-24-(9)-2",
            "нрт-24-9-2",
            "Нрт-24-(9)-2",
            "НРТ-24-(9)-2",
            "НРТ-24-9-2",
            "Нрт 24 9 2",
            "НРт 24 9 2",
            "НРт-24-9-2",
            "Нрт-24-9-2",
            "нрт 24 9 2",
            "НРт-24-(9)-2"
        ],
        "department": "НГО",
        "specialty": "НРт"
    },
    "874": {
        "name": "НРт-24-(9)-3",
        "url": "https://coworking.tyuiu.ru/shs/ngo_t/ngo.php?action=group&union=0&sid=28703&gr=874&year=2025&vr=1",
        "aliases": [
            "Нрт 24 9 3",
            "НРТ-24-(9)-3",
            "НРТ-24-9-3",
            "Нрт-24-(9)-3",
            "нрт 24 9 3",
            "нрт-24-9-3",
            "НРт-24-(9)-3",
            "НРт 24 9 3",
            "НРТ 24 9 3",
            "нрт-24-(9)-3",
            "Нрт-24-9-3",
            "НРт-24-9-3"
        ],
        "department": "НГО",
        "specialty": "НРт"
    },
    "875": {
        "name": "НРт-24-(11)-1",
        "url": "https://coworking.tyuiu.ru/shs/ngo_t/ngo.php?action=group&union=0&sid=28703&gr=875&year=2025&vr=1",
        "aliases": [
            "нрт 24 11 1",
            "НРт-24-11-1",
            "Нрт-24-11-1",
            "НРт 24 11 1",
            "НРт-24-(11)-1",
            "нрт-24-(11)-1",
            "НРТ 24 11 1",
            "нрт-24-11-1",
            "Нрт 24 11 1",
            "НРТ-24-11-1",
            "Нрт-24-(11)-1",
            "НРТ-24-(11)-1"
        ],
        "department": "НГО",
        "specialty": "НРт"
    },
    "876": {
        "name": "НРт-24-(11)-2",
        "url": "https://coworking.tyuiu.ru/shs/ngo_t/ngo.php?action=group&union=0&sid=28703&gr=876&year=2025&vr=1",
        "aliases": [
            "Нрт 24 11 2",
            "НРт-24-(11)-2",
            "НРТ 24 11 2",
            "НРт-24-11-2",
            "Нрт-24-(11)-2",
            "нрт-24-(11)-2",
            "НРт 24 11 2",
            "НРТ-24-11-2",
            "нрт-24-11-2",
            "нрт 24 11 2",
            "НРТ-24-(11)-2",
            "Нрт-24-11-2"
        ],
        "department": "НГО",
        "specialty": "НРт"
    },
    "690": {
        "name": "ОРСр-22-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/ngo_t/ngo.php?action=group&union=0&sid=28703&gr=690&year=2025&vr=1",
        "aliases": [
            "ОРСр-22-(9)-1",
            "орср-22-9-1",
            "ОРСр 22 9 1",
            "ОРСР-22-(9)-1",
            "ОРСр-22-9-1",
            "Орср 22 9 1",
            "Орср-22-(9)-1",
            "ОРСР 22 9 1",
            "Орср-22-9-1",
            "орср-22-(9)-1",
            "ОРСР-22-9-1",
            "орср 22 9 1"
        ],
        "department": "НГО",
        "specialty": "ОРСр"
    },
    "762": {
        "name": "ОРСр-23-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/ngo_t/ngo.php?action=group&union=0&sid=28703&gr=762&year=2025&vr=1",
        "aliases": [
            "Орср 23 9 1",
            "ОРСР 23 9 1",
            "орср-23-9-1",
            "ОРСр 23 9 1",
            "Орср-23-(9)-1",
            "Орср-23-9-1",
            "орср 23 9 1",
            "ОРСр-23-9-1",
            "орср-23-(9)-1",
            "ОРСР-23-9-1",
            "ОРСр-23-(9)-1",
            "ОРСР-23-(9)-1"
        ],
        "department": "НГО",
        "specialty": "ОРСр"
    },
    "867": {
        "name": "ОРСр-24-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/ngo_t/ngo.php?action=group&union=0&sid=28703&gr=867&year=2025&vr=1",
        "aliases": [
            "орср-24-9-1",
            "орср 24 9 1",
            "орср-24-(9)-1",
            "ОРСР-24-9-1",
            "ОРСр-24-(9)-1",
            "Орср-24-9-1",
            "Орср 24 9 1",
            "Орср-24-(9)-1",
            "ОРСР-24-(9)-1",
            "ОРСр-24-9-1",
            "ОРСр 24 9 1",
            "ОРСР 24 9 1"
        ],
        "department": "НГО",
        "specialty": "ОРСр"
    }
}

def get_group_by_name(name):
    ... # см. оригинальную функцию
