def make_aliases(name):
    ... # см. оригинальную функцию

GROUPS_FULL = {
    "667": {
        "name": "МТОт-21-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/mpn_t/mpn.php?action=group&union=0&sid=28705&gr=667&year=2025&vr=1",
        "aliases": [
            "Мтот 21 9 1",
            "мтот-21-9-1",
            "МТОТ-21-(9)-1",
            "Мтот-21-(9)-1",
            "мтот 21 9 1",
            "МТОТ 21 9 1",
            "МТОт-21-(9)-1",
            "МТОт 21 9 1",
            "Мтот-21-9-1",
            "мтот-21-(9)-1",
            "МТОт-21-9-1",
            "МТОТ-21-9-1"
        ],
        "department": "МПН",
        "specialty": "МТОт"
    },
    "742": {
        "name": "МТОт-22-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/mpn_t/mpn.php?action=group&union=0&sid=28705&gr=742&year=2025&vr=1",
        "aliases": [
            "мтот 22 9 1",
            "МТОт-22-(9)-1",
            "МТОТ-22-9-1",
            "Мтот-22-9-1",
            "МТОТ 22 9 1",
            "Мтот-22-(9)-1",
            "МТОт 22 9 1",
            "Мтот 22 9 1",
            "МТОТ-22-(9)-1",
            "МТОт-22-9-1",
            "мтот-22-9-1",
            "мтот-22-(9)-1"
        ],
        "department": "МПН",
        "specialty": "МТОт"
    },
    "664": {
        "name": "МТОт-22-(9)-2",
        "url": "https://coworking.tyuiu.ru/shs/mpn_t/mpn.php?action=group&union=0&sid=28705&gr=664&year=2025&vr=1",
        "aliases": [
            "мтот 22 9 2",
            "МТОТ-22-9-2",
            "мтот-22-(9)-2",
            "Мтот-22-(9)-2",
            "мтот-22-9-2",
            "МТОт-22-(9)-2",
            "МТОТ 22 9 2",
            "МТОт-22-9-2",
            "МТОт 22 9 2",
            "МТОТ-22-(9)-2",
            "Мтот 22 9 2",
            "Мтот-22-9-2"
        ],
        "department": "МПН",
        "specialty": "МТОт"
    },
    "739": {
        "name": "МТОт-22-(11)-1",
        "url": "https://coworking.tyuiu.ru/shs/mpn_t/mpn.php?action=group&union=0&sid=28705&gr=739&year=2025&vr=1",
        "aliases": [
            "МТОт 22 11 1",
            "МТОТ-22-(11)-1",
            "Мтот 22 11 1",
            "мтот-22-(11)-1",
            "МТОТ-22-11-1",
            "мтот-22-11-1",
            "МТОт-22-11-1",
            "МТОт-22-(11)-1",
            "мтот 22 11 1",
            "Мтот-22-11-1",
            "МТОТ 22 11 1",
            "Мтот-22-(11)-1"
        ],
        "department": "МПН",
        "specialty": "МТОт"
    },
    "782": {
        "name": "МТОт-23-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/mpn_t/mpn.php?action=group&union=0&sid=28705&gr=782&year=2025&vr=1",
        "aliases": [
            "мтот-23-(9)-1",
            "МТОт-23-9-1",
            "МТОт 23 9 1",
            "МТОт-23-(9)-1",
            "Мтот-23-9-1",
            "мтот-23-9-1",
            "Мтот-23-(9)-1",
            "МТОТ 23 9 1",
            "МТОТ-23-9-1",
            "мтот 23 9 1",
            "Мтот 23 9 1",
            "МТОТ-23-(9)-1"
        ],
        "department": "МПН",
        "specialty": "МТОт"
    },
    "784": {
        "name": "МТОт-23-(11)-1",
        "url": "https://coworking.tyuiu.ru/shs/mpn_t/mpn.php?action=group&union=0&sid=28705&gr=784&year=2025&vr=1",
        "aliases": [
            "мтот-23-11-1",
            "МТОт-23-11-1",
            "МТОт-23-(11)-1",
            "МТОТ-23-(11)-1",
            "Мтот-23-11-1",
            "МТОт 23 11 1",
            "Мтот-23-(11)-1",
            "МТОТ-23-11-1",
            "мтот 23 11 1",
            "мтот-23-(11)-1",
            "Мтот 23 11 1",
            "МТОТ 23 11 1"
        ],
        "department": "МПН",
        "specialty": "МТОт"
    },
    "858": {
        "name": "МТОт-24-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/mpn_t/mpn.php?action=group&union=0&sid=28705&gr=858&year=2025&vr=1",
        "aliases": [
            "мтот-24-(9)-1",
            "МТОТ-24-9-1",
            "Мтот 24 9 1",
            "МТОТ 24 9 1",
            "МТОт 24 9 1",
            "мтот 24 9 1",
            "Мтот-24-(9)-1",
            "МТОт-24-9-1",
            "МТОт-24-(9)-1",
            "мтот-24-9-1",
            "МТОТ-24-(9)-1",
            "Мтот-24-9-1"
        ],
        "department": "МПН",
        "specialty": "МТОт"
    },
    "859": {
        "name": "МТОт-24-(11)-1",
        "url": "https://coworking.tyuiu.ru/shs/mpn_t/mpn.php?action=group&union=0&sid=28705&gr=859&year=2025&vr=1",
        "aliases": [
            "МТОТ-24-11-1",
            "мтот 24 11 1",
            "мтот-24-11-1",
            "мтот-24-(11)-1",
            "Мтот 24 11 1",
            "МТОТ 24 11 1",
            "Мтот-24-(11)-1",
            "МТОт-24-(11)-1",
            "Мтот-24-11-1",
            "МТОт-24-11-1",
            "МТОт 24 11 1",
            "МТОТ-24-(11)-1"
        ],
        "department": "МПН",
        "specialty": "МТОт"
    },
    "851": {
        "name": "ОМСтр-24-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/mpn_t/mpn.php?action=group&union=0&sid=28705&gr=851&year=2025&vr=1",
        "aliases": [
            "ОМСтр 24 9 1",
            "Омстр-24-(9)-1",
            "омстр-24-(9)-1",
            "ОМСТР 24 9 1",
            "омстр-24-9-1",
            "Омстр 24 9 1",
            "ОМСТР-24-9-1",
            "ОМСТР-24-(9)-1",
            "ОМСтр-24-(9)-1",
            "омстр 24 9 1",
            "Омстр-24-9-1",
            "ОМСтр-24-9-1"
        ],
        "department": "МПН",
        "specialty": "ОМСтр"
    },
    "852": {
        "name": "ОМСтр-24-(11)-1",
        "url": "https://coworking.tyuiu.ru/shs/mpn_t/mpn.php?action=group&union=0&sid=28705&gr=852&year=2025&vr=1",
        "aliases": [
            "Омстр-24-11-1",
            "омстр-24-11-1",
            "ОМСТР-24-11-1",
            "ОМСтр 24 11 1",
            "Омстр 24 11 1",
            "ОМСтр-24-(11)-1",
            "ОМСТР-24-(11)-1",
            "ОМСТР 24 11 1",
            "ОМСтр-24-11-1",
            "Омстр-24-(11)-1",
            "омстр-24-(11)-1",
            "омстр 24 11 1"
        ],
        "department": "МПН",
        "specialty": "ОМСтр"
    },
    "853": {
        "name": "ОМСфр-24-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/mpn_t/mpn.php?action=group&union=0&sid=28705&gr=853&year=2025&vr=1",
        "aliases": [
            "ОМСФР-24-9-1",
            "омсфр-24-9-1",
            "омсфр-24-(9)-1",
            "ОМСФР 24 9 1",
            "ОМСфр 24 9 1",
            "Омсфр 24 9 1",
            "Омсфр-24-9-1",
            "Омсфр-24-(9)-1",
            "омсфр 24 9 1",
            "ОМСфр-24-(9)-1",
            "ОМСФР-24-(9)-1",
            "ОМСфр-24-9-1"
        ],
        "department": "МПН",
        "specialty": "ОМСфр"
    },
    "854": {
        "name": "ОМСфр-24-(11)-1",
        "url": "https://coworking.tyuiu.ru/shs/mpn_t/mpn.php?action=group&union=0&sid=28705&gr=854&year=2025&vr=1",
        "aliases": [
            "Омсфр-24-(11)-1",
            "омсфр 24 11 1",
            "омсфр-24-11-1",
            "омсфр-24-(11)-1",
            "Омсфр-24-11-1",
            "ОМСфр 24 11 1",
            "ОМСФР-24-11-1",
            "Омсфр 24 11 1",
            "ОМСфр-24-(11)-1",
            "ОМСфр-24-11-1",
            "ОМСФР 24 11 1",
            "ОМСФР-24-(11)-1"
        ],
        "department": "МПН",
        "specialty": "ОМСфр"
    },
    "860": {
        "name": "ПНГт-24-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/mpn_t/mpn.php?action=group&union=0&sid=28705&gr=860&year=2025&vr=1",
        "aliases": [
            "ПНГт-24-(9)-1",
            "ПНГТ-24-(9)-1",
            "пнгт 24 9 1",
            "Пнгт 24 9 1",
            "ПНГТ 24 9 1",
            "ПНГт-24-9-1",
            "Пнгт-24-9-1",
            "ПНГт 24 9 1",
            "Пнгт-24-(9)-1",
            "пнгт-24-9-1",
            "пнгт-24-(9)-1",
            "ПНГТ-24-9-1"
        ],
        "department": "МПН",
        "specialty": "ПНГт"
    },
    "665": {
        "name": "ТМт-21-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/mpn_t/mpn.php?action=group&union=0&sid=28705&gr=665&year=2025&vr=1",
        "aliases": [
            "ТМТ-21-(9)-1",
            "Тмт 21 9 1",
            "тмт 21 9 1",
            "тмт-21-(9)-1",
            "ТМт-21-9-1",
            "тмт-21-9-1",
            "Тмт-21-(9)-1",
            "ТМт 21 9 1",
            "ТМТ 21 9 1",
            "ТМт-21-(9)-1",
            "Тмт-21-9-1",
            "ТМТ-21-9-1"
        ],
        "department": "МПН",
        "specialty": "ТМт"
    },
    "666": {
        "name": "ТМт-21-(9)-2",
        "url": "https://coworking.tyuiu.ru/shs/mpn_t/mpn.php?action=group&union=0&sid=28705&gr=666&year=2025&vr=1",
        "aliases": [
            "ТМт-21-(9)-2",
            "ТМТ-21-9-2",
            "ТМТ 21 9 2",
            "ТМТ-21-(9)-2",
            "тмт-21-9-2",
            "тмт-21-(9)-2",
            "Тмт-21-(9)-2",
            "тмт 21 9 2",
            "Тмт-21-9-2",
            "ТМт 21 9 2",
            "Тмт 21 9 2",
            "ТМт-21-9-2"
        ],
        "department": "МПН",
        "specialty": "ТМт"
    },
    "737": {
        "name": "ТМт-22-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/mpn_t/mpn.php?action=group&union=0&sid=28705&gr=737&year=2025&vr=1",
        "aliases": [
            "тмт-22-(9)-1",
            "ТМт-22-9-1",
            "ТМт-22-(9)-1",
            "ТМТ 22 9 1",
            "ТМт 22 9 1",
            "ТМТ-22-9-1",
            "ТМТ-22-(9)-1",
            "тмт 22 9 1",
            "тмт-22-9-1",
            "Тмт-22-(9)-1",
            "Тмт 22 9 1",
            "Тмт-22-9-1"
        ],
        "department": "МПН",
        "specialty": "ТМт"
    },
    "738": {
        "name": "ТМт-22-(9)-2",
        "url": "https://coworking.tyuiu.ru/shs/mpn_t/mpn.php?action=group&union=0&sid=28705&gr=738&year=2025&vr=1",
        "aliases": [
            "тмт 22 9 2",
            "ТМт 22 9 2",
            "ТМТ-22-(9)-2",
            "Тмт-22-(9)-2",
            "ТМт-22-9-2",
            "ТМт-22-(9)-2",
            "тмт-22-9-2",
            "Тмт-22-9-2",
            "Тмт 22 9 2",
            "ТМТ 22 9 2",
            "ТМТ-22-9-2",
            "тмт-22-(9)-2"
        ],
        "department": "МПН",
        "specialty": "ТМт"
    },
    "785": {
        "name": "ТМт-23-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/mpn_t/mpn.php?action=group&union=0&sid=28705&gr=785&year=2025&vr=1",
        "aliases": [
            "Тмт 23 9 1",
            "тмт-23-9-1",
            "ТМт 23 9 1",
            "Тмт-23-(9)-1",
            "ТМТ 23 9 1",
            "тмт 23 9 1",
            "ТМТ-23-9-1",
            "ТМТ-23-(9)-1",
            "тмт-23-(9)-1",
            "Тмт-23-9-1",
            "ТМт-23-9-1",
            "ТМт-23-(9)-1"
        ],
        "department": "МПН",
        "specialty": "ТМт"
    },
    "786": {
        "name": "ТМт-23-(9)-2",
        "url": "https://coworking.tyuiu.ru/shs/mpn_t/mpn.php?action=group&union=0&sid=28705&gr=786&year=2025&vr=1",
        "aliases": [
            "ТМТ-23-(9)-2",
            "тмт-23-(9)-2",
            "ТМт-23-(9)-2",
            "Тмт-23-9-2",
            "ТМт-23-9-2",
            "ТМт 23 9 2",
            "ТМТ-23-9-2",
            "тмт-23-9-2",
            "Тмт-23-(9)-2",
            "тмт 23 9 2",
            "Тмт 23 9 2",
            "ТМТ 23 9 2"
        ],
        "department": "МПН",
        "specialty": "ТМт"
    },
    "856": {
        "name": "ТМт-24-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/mpn_t/mpn.php?action=group&union=0&sid=28705&gr=856&year=2025&vr=1",
        "aliases": [
            "ТМТ 24 9 1",
            "ТМТ-24-9-1",
            "ТМт-24-9-1",
            "Тмт 24 9 1",
            "тмт 24 9 1",
            "тмт-24-9-1",
            "Тмт-24-9-1",
            "ТМт-24-(9)-1",
            "Тмт-24-(9)-1",
            "тмт-24-(9)-1",
            "ТМТ-24-(9)-1",
            "ТМт 24 9 1"
        ],
        "department": "МПН",
        "specialty": "ТМт"
    },
    "857": {
        "name": "ТМт-24-(9)-2",
        "url": "https://coworking.tyuiu.ru/shs/mpn_t/mpn.php?action=group&union=0&sid=28705&gr=857&year=2025&vr=1",
        "aliases": [
            "тмт-24-9-2",
            "ТМт-24-(9)-2",
            "тмт 24 9 2",
            "ТМт-24-9-2",
            "Тмт-24-(9)-2",
            "ТМТ 24 9 2",
            "тмт-24-(9)-2",
            "ТМт 24 9 2",
            "Тмт 24 9 2",
            "ТМТ-24-(9)-2",
            "Тмт-24-9-2",
            "ТМТ-24-9-2"
        ],
        "department": "МПН",
        "specialty": "ТМт"
    },
    "777": {
        "name": "ТСр-23-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/mpn_t/mpn.php?action=group&union=0&sid=28705&gr=777&year=2025&vr=1",
        "aliases": [
            "тср 23 9 1",
            "Тср 23 9 1",
            "Тср-23-9-1",
            "ТСР-23-(9)-1",
            "ТСР-23-9-1",
            "Тср-23-(9)-1",
            "ТСр-23-(9)-1",
            "ТСР 23 9 1",
            "ТСр-23-9-1",
            "ТСр 23 9 1",
            "тср-23-9-1",
            "тср-23-(9)-1"
        ],
        "department": "МПН",
        "specialty": "ТСр"
    },
    "663": {
        "name": "ТТОт-21-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/mpn_t/mpn.php?action=group&union=0&sid=28705&gr=663&year=2025&vr=1",
        "aliases": [
            "ттот-21-(9)-1",
            "ТТОт 21 9 1",
            "Ттот 21 9 1",
            "ттот-21-9-1",
            "ТТОт-21-9-1",
            "Ттот-21-9-1",
            "ТТОТ 21 9 1",
            "ТТОТ-21-(9)-1",
            "ТТОТ-21-9-1",
            "Ттот-21-(9)-1",
            "ТТОт-21-(9)-1",
            "ттот 21 9 1"
        ],
        "department": "МПН",
        "specialty": "ТТОт"
    },
    "736": {
        "name": "ТТОт-22-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/mpn_t/mpn.php?action=group&union=0&sid=28705&gr=736&year=2025&vr=1",
        "aliases": [
            "ттот-22-9-1",
            "ТТОт-22-(9)-1",
            "ТТОт 22 9 1",
            "ТТОТ-22-(9)-1",
            "ТТОТ-22-9-1",
            "Ттот-22-(9)-1",
            "ттот-22-(9)-1",
            "ттот 22 9 1",
            "ТТОт-22-9-1",
            "Ттот 22 9 1",
            "ТТОТ 22 9 1",
            "Ттот-22-9-1"
        ],
        "department": "МПН",
        "specialty": "ТТОт"
    },
    "781": {
        "name": "ТТОт-23-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/mpn_t/mpn.php?action=group&union=0&sid=28705&gr=781&year=2025&vr=1",
        "aliases": [
            "ТТОТ-23-9-1",
            "ттот-23-9-1",
            "Ттот-23-(9)-1",
            "ТТОТ 23 9 1",
            "Ттот-23-9-1",
            "ТТОт 23 9 1",
            "ТТОТ-23-(9)-1",
            "ттот 23 9 1",
            "ТТОт-23-(9)-1",
            "Ттот 23 9 1",
            "ттот-23-(9)-1",
            "ТТОт-23-9-1"
        ],
        "department": "МПН",
        "specialty": "ТТОт"
    },
    "855": {
        "name": "ТТОт-24-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/mpn_t/mpn.php?action=group&union=0&sid=28705&gr=855&year=2025&vr=1",
        "aliases": [
            "ТТОТ-24-9-1",
            "ттот 24 9 1",
            "ТТОт-24-(9)-1",
            "ТТОТ 24 9 1",
            "ттот-24-9-1",
            "ТТОт 24 9 1",
            "ТТОТ-24-(9)-1",
            "ТТОт-24-9-1",
            "ттот-24-(9)-1",
            "Ттот 24 9 1",
            "Ттот-24-9-1",
            "Ттот-24-(9)-1"
        ],
        "department": "МПН",
        "specialty": "ТТОт"
    },
    "861": {
        "name": "УКПт-24-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/mpn_t/mpn.php?action=group&union=0&sid=28705&gr=861&year=2025&vr=1",
        "aliases": [
            "Укпт-24-(9)-1",
            "УКПТ-24-9-1",
            "УКПт-24-9-1",
            "УКПт 24 9 1",
            "укпт-24-9-1",
            "Укпт-24-9-1",
            "укпт 24 9 1",
            "Укпт 24 9 1",
            "УКПт-24-(9)-1",
            "УКПТ 24 9 1",
            "укпт-24-(9)-1",
            "УКПТ-24-(9)-1"
        ],
        "department": "МПН",
        "specialty": "УКПт"
    },
    "779": {
        "name": "ФСр-23-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/mpn_t/mpn.php?action=group&union=0&sid=28705&gr=779&year=2025&vr=1",
        "aliases": [
            "ФСР 23 9 1",
            "ФСр-23-9-1",
            "ФСр 23 9 1",
            "Фср-23-9-1",
            "Фср 23 9 1",
            "ФСР-23-(9)-1",
            "фср-23-(9)-1",
            "ФСР-23-9-1",
            "Фср-23-(9)-1",
            "ФСр-23-(9)-1",
            "фср-23-9-1",
            "фср 23 9 1"
        ],
        "department": "МПН",
        "specialty": "ФСр"
    },
    "700": {
        "name": "ПНГт-21-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/mpn_t/mpn.php?action=group&union=0&sid=28705&gr=700&year=2025&vr=1",
        "aliases": [
            "Пнгт 21 9 1",
            "Пнгт-21-(9)-1",
            "Пнгт-21-9-1",
            "ПНГт-21-9-1",
            "ПНГТ 21 9 1",
            "ПНГт 21 9 1",
            "ПНГТ-21-(9)-1",
            "ПНГТ-21-9-1",
            "пнгт 21 9 1",
            "пнгт-21-(9)-1",
            "ПНГт-21-(9)-1",
            "пнгт-21-9-1"
        ],
        "department": "МПН",
        "specialty": "ПНГт"
    },
    "740": {
        "name": "ПНГт-22-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/mpn_t/mpn.php?action=group&union=0&sid=28705&gr=740&year=2025&vr=1",
        "aliases": [
            "Пнгт-22-(9)-1",
            "Пнгт-22-9-1",
            "пнгт-22-(9)-1",
            "ПНГТ-22-9-1",
            "ПНГт 22 9 1",
            "ПНГт-22-(9)-1",
            "Пнгт 22 9 1",
            "ПНГт-22-9-1",
            "ПНГТ 22 9 1",
            "пнгт 22 9 1",
            "ПНГТ-22-(9)-1",
            "пнгт-22-9-1"
        ],
        "department": "МПН",
        "specialty": "ПНГт"
    },
    "787": {
        "name": "ПНГт-23-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/mpn_t/mpn.php?action=group&union=0&sid=28705&gr=787&year=2025&vr=1",
        "aliases": [
            "ПНГт-23-(9)-1",
            "Пнгт 23 9 1",
            "Пнгт-23-9-1",
            "ПНГТ 23 9 1",
            "ПНГТ-23-(9)-1",
            "Пнгт-23-(9)-1",
            "пнгт 23 9 1",
            "ПНГт 23 9 1",
            "ПНГТ-23-9-1",
            "ПНГт-23-9-1",
            "пнгт-23-9-1",
            "пнгт-23-(9)-1"
        ],
        "department": "МПН",
        "specialty": "ПНГт"
    },
    "747": {
        "name": "ПНГт-23-(11)-1",
        "url": "https://coworking.tyuiu.ru/shs/mpn_t/mpn.php?action=group&union=0&sid=28705&gr=747&year=2025&vr=1",
        "aliases": [
            "ПНГт-23-(11)-1",
            "ПНГТ 23 11 1",
            "ПНГт-23-11-1",
            "ПНГТ-23-11-1",
            "ПНГт 23 11 1",
            "пнгт 23 11 1",
            "Пнгт-23-(11)-1",
            "Пнгт-23-11-1",
            "пнгт-23-(11)-1",
            "ПНГТ-23-(11)-1",
            "пнгт-23-11-1",
            "Пнгт 23 11 1"
        ],
        "department": "МПН",
        "specialty": "ПНГт"
    },
    "862": {
        "name": "ПНГт-24-(11)-1",
        "url": "https://coworking.tyuiu.ru/shs/mpn_t/mpn.php?action=group&union=0&sid=28705&gr=862&year=2025&vr=1",
        "aliases": [
            "Пнгт-24-11-1",
            "ПНГт-24-(11)-1",
            "пнгт-24-(11)-1",
            "ПНГТ-24-(11)-1",
            "ПНГт 24 11 1",
            "ПНГТ 24 11 1",
            "Пнгт-24-(11)-1",
            "Пнгт 24 11 1",
            "пнгт 24 11 1",
            "ПНГТ-24-11-1",
            "ПНГт-24-11-1",
            "пнгт-24-11-1"
        ],
        "department": "МПН",
        "specialty": "ПНГт"
    },
    "701": {
        "name": "УКПт-21-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/mpn_t/mpn.php?action=group&union=0&sid=28705&gr=701&year=2025&vr=1",
        "aliases": [
            "Укпт 21 9 1",
            "УКПт-21-(9)-1",
            "УКПТ-21-(9)-1",
            "Укпт-21-(9)-1",
            "УКПт 21 9 1",
            "укпт 21 9 1",
            "УКПТ 21 9 1",
            "укпт-21-9-1",
            "УКПТ-21-9-1",
            "укпт-21-(9)-1",
            "Укпт-21-9-1",
            "УКПт-21-9-1"
        ],
        "department": "МПН",
        "specialty": "УКПт"
    },
    "741": {
        "name": "УКПт-22-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/mpn_t/mpn.php?action=group&union=0&sid=28705&gr=741&year=2025&vr=1",
        "aliases": [
            "укпт-22-9-1",
            "УКПт-22-9-1",
            "Укпт 22 9 1",
            "УКПТ-22-(9)-1",
            "УКПТ-22-9-1",
            "УКПт 22 9 1",
            "укпт-22-(9)-1",
            "Укпт-22-(9)-1",
            "Укпт-22-9-1",
            "укпт 22 9 1",
            "УКПт-22-(9)-1",
            "УКПТ 22 9 1"
        ],
        "department": "МПН",
        "specialty": "УКПт"
    },
    "788": {
        "name": "УКПт-23-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/mpn_t/mpn.php?action=group&union=0&sid=28705&gr=788&year=2025&vr=1",
        "aliases": [
            "УКПт 23 9 1",
            "Укпт-23-9-1",
            "УКПТ-23-9-1",
            "Укпт 23 9 1",
            "укпт 23 9 1",
            "Укпт-23-(9)-1",
            "укпт-23-(9)-1",
            "УКПТ-23-(9)-1",
            "УКПт-23-(9)-1",
            "УКПт-23-9-1",
            "УКПТ 23 9 1",
            "укпт-23-9-1"
        ],
        "department": "МПН",
        "specialty": "УКПт"
    },
    "746": {
        "name": "УКПт-23-(11)-1",
        "url": "https://coworking.tyuiu.ru/shs/mpn_t/mpn.php?action=group&union=0&sid=28705&gr=746&year=2025&vr=1",
        "aliases": [
            "УКПТ-23-11-1",
            "УКПт 23 11 1",
            "укпт-23-11-1",
            "укпт 23 11 1",
            "укпт-23-(11)-1",
            "УКПТ-23-(11)-1",
            "Укпт-23-(11)-1",
            "УКПт-23-(11)-1",
            "Укпт 23 11 1",
            "УКПт-23-11-1",
            "Укпт-23-11-1",
            "УКПТ 23 11 1"
        ],
        "department": "МПН",
        "specialty": "УКПт"
    },
    "863": {
        "name": "УКПт-24-(11)-1",
        "url": "https://coworking.tyuiu.ru/shs/mpn_t/mpn.php?action=group&union=0&sid=28705&gr=863&year=2025&vr=1",
        "aliases": [
            "Укпт-24-(11)-1",
            "УКПт-24-11-1",
            "укпт 24 11 1",
            "УКПТ 24 11 1",
            "УКПТ-24-11-1",
            "Укпт 24 11 1",
            "укпт-24-11-1",
            "УКПт 24 11 1",
            "Укпт-24-11-1",
            "укпт-24-(11)-1",
            "УКПт-24-(11)-1",
            "УКПТ-24-(11)-1"
        ],
        "department": "МПН",
        "specialty": "УКПт"
    }
}

def get_group_by_name(name):
    ... # см. оригинальную функцию
