def make_aliases(name):
    ... # см. оригинальную функцию

GROUPS_FULL = {
    "642": {
        "name": "МГСт-21-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/po_t/po.php?action=group&union=0&sid=28706&gr=642&year=2025&vr=1",
        "aliases": [
            "мгст-21-(9)-1",
            "МГСт-21-(9)-1",
            "МГСТ-21-9-1",
            "Мгст 21 9 1",
            "МГСт 21 9 1",
            "МГСТ-21-(9)-1",
            "мгст-21-9-1",
            "мгст 21 9 1",
            "МГСт-21-9-1",
            "Мгст-21-(9)-1",
            "МГСТ 21 9 1",
            "Мгст-21-9-1"
        ],
        "department": "ПО",
        "specialty": "МГСт"
    },
    "714": {
        "name": "МГСт-22-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/po_t/po.php?action=group&union=0&sid=28706&gr=714&year=2025&vr=1",
        "aliases": [
            "Мгст 22 9 1",
            "мгст-22-9-1",
            "Мгст-22-(9)-1",
            "мгст-22-(9)-1",
            "МГСТ-22-9-1",
            "Мгст-22-9-1",
            "мгст 22 9 1",
            "МГСт-22-(9)-1",
            "МГСт-22-9-1",
            "МГСт 22 9 1",
            "МГСТ-22-(9)-1",
            "МГСТ 22 9 1"
        ],
        "department": "ПО",
        "specialty": "МГСт"
    },
    "800": {
        "name": "МГСт-23-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/po_t/po.php?action=group&union=0&sid=28706&gr=800&year=2025&vr=1",
        "aliases": [
            "Мгст-23-9-1",
            "Мгст 23 9 1",
            "МГСТ-23-(9)-1",
            "Мгст-23-(9)-1",
            "МГСт-23-9-1",
            "мгст-23-9-1",
            "мгст-23-(9)-1",
            "МГСТ 23 9 1",
            "мгст 23 9 1",
            "МГСТ-23-9-1",
            "МГСт 23 9 1",
            "МГСт-23-(9)-1"
        ],
        "department": "ПО",
        "specialty": "МГСт"
    },
    "826": {
        "name": "МГСт-24-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/po_t/po.php?action=group&union=0&sid=28706&gr=826&year=2025&vr=1",
        "aliases": [
            "мгст-24-9-1",
            "МГСТ 24 9 1",
            "Мгст-24-(9)-1",
            "МГСт-24-(9)-1",
            "МГСт-24-9-1",
            "Мгст-24-9-1",
            "МГСТ-24-(9)-1",
            "Мгст 24 9 1",
            "МГСт 24 9 1",
            "МГСТ-24-9-1",
            "мгст-24-(9)-1",
            "мгст 24 9 1"
        ],
        "department": "ПО",
        "specialty": "МГСт"
    },
    "643": {
        "name": "РСАт-21-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/po_t/po.php?action=group&union=0&sid=28706&gr=643&year=2025&vr=1",
        "aliases": [
            "Рсат 21 9 1",
            "РСАТ-21-9-1",
            "Рсат-21-(9)-1",
            "РСАт 21 9 1",
            "рсат 21 9 1",
            "рсат-21-9-1",
            "РСАТ-21-(9)-1",
            "РСАт-21-9-1",
            "РСАт-21-(9)-1",
            "Рсат-21-9-1",
            "рсат-21-(9)-1",
            "РСАТ 21 9 1"
        ],
        "department": "ПО",
        "specialty": "РСАт"
    },
    "644": {
        "name": "РСАт-21-(9)-2",
        "url": "https://coworking.tyuiu.ru/shs/po_t/po.php?action=group&union=0&sid=28706&gr=644&year=2025&vr=1",
        "aliases": [
            "РСАТ-21-(9)-2",
            "Рсат 21 9 2",
            "рсат 21 9 2",
            "РСАТ-21-9-2",
            "РСАт-21-9-2",
            "Рсат-21-(9)-2",
            "РСАТ 21 9 2",
            "РСАт 21 9 2",
            "рсат-21-9-2",
            "РСАт-21-(9)-2",
            "рсат-21-(9)-2",
            "Рсат-21-9-2"
        ],
        "department": "ПО",
        "specialty": "РСАт"
    },
    "715": {
        "name": "РСАт-22-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/po_t/po.php?action=group&union=0&sid=28706&gr=715&year=2025&vr=1",
        "aliases": [
            "РСАТ-22-(9)-1",
            "рсат-22-9-1",
            "Рсат 22 9 1",
            "РСАТ-22-9-1",
            "рсат-22-(9)-1",
            "рсат 22 9 1",
            "РСАТ 22 9 1",
            "Рсат-22-9-1",
            "РСАт-22-(9)-1",
            "РСАт-22-9-1",
            "РСАт 22 9 1",
            "Рсат-22-(9)-1"
        ],
        "department": "ПО",
        "specialty": "РСАт"
    },
    "716": {
        "name": "РСАт-22-(9)-2",
        "url": "https://coworking.tyuiu.ru/shs/po_t/po.php?action=group&union=0&sid=28706&gr=716&year=2025&vr=1",
        "aliases": [
            "РСАТ-22-(9)-2",
            "Рсат-22-(9)-2",
            "РСАт-22-(9)-2",
            "РСАТ 22 9 2",
            "рсат-22-(9)-2",
            "рсат 22 9 2",
            "РСАТ-22-9-2",
            "РСАт-22-9-2",
            "Рсат-22-9-2",
            "Рсат 22 9 2",
            "РСАт 22 9 2",
            "рсат-22-9-2"
        ],
        "department": "ПО",
        "specialty": "РСАт"
    },
    "717": {
        "name": "РСАт-22-(11)-1",
        "url": "https://coworking.tyuiu.ru/shs/po_t/po.php?action=group&union=0&sid=28706&gr=717&year=2025&vr=1",
        "aliases": [
            "РСАТ 22 11 1",
            "Рсат-22-(11)-1",
            "РСАТ-22-(11)-1",
            "РСАт 22 11 1",
            "рсат-22-(11)-1",
            "Рсат 22 11 1",
            "РСАт-22-(11)-1",
            "рсат 22 11 1",
            "рсат-22-11-1",
            "РСАТ-22-11-1",
            "Рсат-22-11-1",
            "РСАт-22-11-1"
        ],
        "department": "ПО",
        "specialty": "РСАт"
    },
    "801": {
        "name": "РСАт-23-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/po_t/po.php?action=group&union=0&sid=28706&gr=801&year=2025&vr=1",
        "aliases": [
            "РСАт 23 9 1",
            "Рсат-23-(9)-1",
            "рсат-23-(9)-1",
            "РСАТ-23-9-1",
            "рсат 23 9 1",
            "РСАт-23-9-1",
            "рсат-23-9-1",
            "РСАТ 23 9 1",
            "Рсат-23-9-1",
            "РСАТ-23-(9)-1",
            "Рсат 23 9 1",
            "РСАт-23-(9)-1"
        ],
        "department": "ПО",
        "specialty": "РСАт"
    },
    "802": {
        "name": "РСАт-23-(9)-2",
        "url": "https://coworking.tyuiu.ru/shs/po_t/po.php?action=group&union=0&sid=28706&gr=802&year=2025&vr=1",
        "aliases": [
            "РСАт-23-9-2",
            "РСАт 23 9 2",
            "РСАТ-23-9-2",
            "Рсат-23-9-2",
            "рсат-23-(9)-2",
            "рсат 23 9 2",
            "Рсат-23-(9)-2",
            "Рсат 23 9 2",
            "РСАТ-23-(9)-2",
            "РСАТ 23 9 2",
            "рсат-23-9-2",
            "РСАт-23-(9)-2"
        ],
        "department": "ПО",
        "specialty": "РСАт"
    },
    "803": {
        "name": "РСАт-23-(11)-1",
        "url": "https://coworking.tyuiu.ru/shs/po_t/po.php?action=group&union=0&sid=28706&gr=803&year=2025&vr=1",
        "aliases": [
            "рсат-23-(11)-1",
            "Рсат-23-(11)-1",
            "Рсат-23-11-1",
            "РСАт-23-11-1",
            "РСАТ-23-(11)-1",
            "рсат 23 11 1",
            "РСАТ-23-11-1",
            "РСАт-23-(11)-1",
            "РСАт 23 11 1",
            "Рсат 23 11 1",
            "рсат-23-11-1",
            "РСАТ 23 11 1"
        ],
        "department": "ПО",
        "specialty": "РСАт"
    },
    "831": {
        "name": "РСАт-24-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/po_t/po.php?action=group&union=0&sid=28706&gr=831&year=2025&vr=1",
        "aliases": [
            "Рсат 24 9 1",
            "РСАТ-24-(9)-1",
            "рсат 24 9 1",
            "РСАт 24 9 1",
            "РСАт-24-(9)-1",
            "рсат-24-9-1",
            "РСАТ 24 9 1",
            "РСАТ-24-9-1",
            "Рсат-24-9-1",
            "рсат-24-(9)-1",
            "РСАт-24-9-1",
            "Рсат-24-(9)-1"
        ],
        "department": "ПО",
        "specialty": "РСАт"
    },
    "832": {
        "name": "РСАт-24-(9)-2",
        "url": "https://coworking.tyuiu.ru/shs/po_t/po.php?action=group&union=0&sid=28706&gr=832&year=2025&vr=1",
        "aliases": [
            "рсат-24-9-2",
            "РСАт-24-(9)-2",
            "Рсат 24 9 2",
            "РСАт 24 9 2",
            "рсат 24 9 2",
            "Рсат-24-9-2",
            "РСАТ 24 9 2",
            "рсат-24-(9)-2",
            "РСАт-24-9-2",
            "РСАТ-24-(9)-2",
            "РСАТ-24-9-2",
            "Рсат-24-(9)-2"
        ],
        "department": "ПО",
        "specialty": "РСАт"
    },
    "833": {
        "name": "РСАт-24-(9)-3",
        "url": "https://coworking.tyuiu.ru/shs/po_t/po.php?action=group&union=0&sid=28706&gr=833&year=2025&vr=1",
        "aliases": [
            "РСАТ-24-9-3",
            "РСАт-24-9-3",
            "РСАТ-24-(9)-3",
            "рсат-24-9-3",
            "Рсат-24-(9)-3",
            "Рсат 24 9 3",
            "рсат-24-(9)-3",
            "рсат 24 9 3",
            "РСАт 24 9 3",
            "Рсат-24-9-3",
            "РСАт-24-(9)-3",
            "РСАТ 24 9 3"
        ],
        "department": "ПО",
        "specialty": "РСАт"
    },
    "834": {
        "name": "РСАт-24-(11)-1",
        "url": "https://coworking.tyuiu.ru/shs/po_t/po.php?action=group&union=0&sid=28706&gr=834&year=2025&vr=1",
        "aliases": [
            "РСАт-24-11-1",
            "рсат-24-(11)-1",
            "рсат-24-11-1",
            "Рсат 24 11 1",
            "Рсат-24-11-1",
            "РСАт 24 11 1",
            "РСАт-24-(11)-1",
            "рсат 24 11 1",
            "Рсат-24-(11)-1",
            "РСАТ-24-(11)-1",
            "РСАТ-24-11-1",
            "РСАТ 24 11 1"
        ],
        "department": "ПО",
        "specialty": "РСАт"
    },
    "646": {
        "name": "СЭЗт-21-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/po_t/po.php?action=group&union=0&sid=28706&gr=646&year=2025&vr=1",
        "aliases": [
            "Сэзт 21 9 1",
            "СЭЗт-21-9-1",
            "сэзт 21 9 1",
            "СЭЗт 21 9 1",
            "СЭЗТ 21 9 1",
            "сэзт-21-(9)-1",
            "Сэзт-21-(9)-1",
            "СЭЗТ-21-(9)-1",
            "СЭЗТ-21-9-1",
            "сэзт-21-9-1",
            "Сэзт-21-9-1",
            "СЭЗт-21-(9)-1"
        ],
        "department": "ПО",
        "specialty": "СЭЗт"
    },
    "647": {
        "name": "СЭЗт-21-(9)-2",
        "url": "https://coworking.tyuiu.ru/shs/po_t/po.php?action=group&union=0&sid=28706&gr=647&year=2025&vr=1",
        "aliases": [
            "СЭЗт 21 9 2",
            "СЭЗт-21-9-2",
            "СЭЗТ-21-(9)-2",
            "сэзт-21-(9)-2",
            "сэзт 21 9 2",
            "СЭЗт-21-(9)-2",
            "СЭЗТ 21 9 2",
            "СЭЗТ-21-9-2",
            "Сэзт-21-9-2",
            "сэзт-21-9-2",
            "Сэзт 21 9 2",
            "Сэзт-21-(9)-2"
        ],
        "department": "ПО",
        "specialty": "СЭЗт"
    },
    "718": {
        "name": "СЭЗт-22-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/po_t/po.php?action=group&union=0&sid=28706&gr=718&year=2025&vr=1",
        "aliases": [
            "СЭЗт-22-(9)-1",
            "сэзт-22-(9)-1",
            "СЭЗТ 22 9 1",
            "СЭЗт 22 9 1",
            "сэзт 22 9 1",
            "СЭЗт-22-9-1",
            "Сэзт 22 9 1",
            "сэзт-22-9-1",
            "Сэзт-22-9-1",
            "СЭЗТ-22-(9)-1",
            "СЭЗТ-22-9-1",
            "Сэзт-22-(9)-1"
        ],
        "department": "ПО",
        "specialty": "СЭЗт"
    },
    "719": {
        "name": "СЭЗт-22-(9)-2",
        "url": "https://coworking.tyuiu.ru/shs/po_t/po.php?action=group&union=0&sid=28706&gr=719&year=2025&vr=1",
        "aliases": [
            "сэзт 22 9 2",
            "сэзт-22-(9)-2",
            "Сэзт-22-9-2",
            "СЭЗТ-22-(9)-2",
            "СЭЗт-22-(9)-2",
            "СЭЗТ-22-9-2",
            "СЭЗт-22-9-2",
            "сэзт-22-9-2",
            "Сэзт 22 9 2",
            "СЭЗт 22 9 2",
            "Сэзт-22-(9)-2",
            "СЭЗТ 22 9 2"
        ],
        "department": "ПО",
        "specialty": "СЭЗт"
    },
    "720": {
        "name": "СЭЗт-22-(9)-3",
        "url": "https://coworking.tyuiu.ru/shs/po_t/po.php?action=group&union=0&sid=28706&gr=720&year=2025&vr=1",
        "aliases": [
            "СЭЗТ-22-(9)-3",
            "Сэзт 22 9 3",
            "СЭЗт-22-(9)-3",
            "сэзт-22-(9)-3",
            "Сэзт-22-9-3",
            "СЭЗт-22-9-3",
            "Сэзт-22-(9)-3",
            "СЭЗТ 22 9 3",
            "сэзт-22-9-3",
            "СЭЗТ-22-9-3",
            "СЭЗт 22 9 3",
            "сэзт 22 9 3"
        ],
        "department": "ПО",
        "specialty": "СЭЗт"
    },
    "428": {
        "name": "СЭЗт-22-(9)-4",
        "url": "https://coworking.tyuiu.ru/shs/po_t/po.php?action=group&union=0&sid=28706&gr=428&year=2025&vr=1",
        "aliases": [
            "СЭЗт-22-(9)-4",
            "СЭЗТ 22 9 4",
            "Сэзт-22-(9)-4",
            "СЭЗт-22-9-4",
            "СЭЗТ-22-(9)-4",
            "Сэзт 22 9 4",
            "сэзт-22-(9)-4",
            "Сэзт-22-9-4",
            "сэзт-22-9-4",
            "СЭЗт 22 9 4",
            "СЭЗТ-22-9-4",
            "сэзт 22 9 4"
        ],
        "department": "ПО",
        "specialty": "СЭЗт"
    },
    "721": {
        "name": "СЭЗт-22-(11)-1",
        "url": "https://coworking.tyuiu.ru/shs/po_t/po.php?action=group&union=0&sid=28706&gr=721&year=2025&vr=1",
        "aliases": [
            "сэзт-22-11-1",
            "СЭЗТ-22-(11)-1",
            "СЭЗт 22 11 1",
            "сэзт 22 11 1",
            "Сэзт-22-11-1",
            "СЭЗТ 22 11 1",
            "сэзт-22-(11)-1",
            "Сэзт-22-(11)-1",
            "СЭЗТ-22-11-1",
            "Сэзт 22 11 1",
            "СЭЗт-22-(11)-1",
            "СЭЗт-22-11-1"
        ],
        "department": "ПО",
        "specialty": "СЭЗт"
    },
    "804": {
        "name": "СЭЗт-23-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/po_t/po.php?action=group&union=0&sid=28706&gr=804&year=2025&vr=1",
        "aliases": [
            "СЭЗт-23-9-1",
            "сэзт-23-(9)-1",
            "Сэзт-23-(9)-1",
            "СЭЗТ-23-(9)-1",
            "СЭЗт 23 9 1",
            "СЭЗТ 23 9 1",
            "СЭЗт-23-(9)-1",
            "сэзт 23 9 1",
            "Сэзт-23-9-1",
            "Сэзт 23 9 1",
            "СЭЗТ-23-9-1",
            "сэзт-23-9-1"
        ],
        "department": "ПО",
        "specialty": "СЭЗт"
    },
    "805": {
        "name": "СЭЗт-23-(9)-2",
        "url": "https://coworking.tyuiu.ru/shs/po_t/po.php?action=group&union=0&sid=28706&gr=805&year=2025&vr=1",
        "aliases": [
            "Сэзт-23-(9)-2",
            "Сэзт-23-9-2",
            "СЭЗТ-23-(9)-2",
            "Сэзт 23 9 2",
            "СЭЗт-23-9-2",
            "сэзт 23 9 2",
            "СЭЗТ-23-9-2",
            "СЭЗт-23-(9)-2",
            "сэзт-23-(9)-2",
            "сэзт-23-9-2",
            "СЭЗт 23 9 2",
            "СЭЗТ 23 9 2"
        ],
        "department": "ПО",
        "specialty": "СЭЗт"
    },
    "806": {
        "name": "СЭЗт-23-(9)-3",
        "url": "https://coworking.tyuiu.ru/shs/po_t/po.php?action=group&union=0&sid=28706&gr=806&year=2025&vr=1",
        "aliases": [
            "СЭЗТ 23 9 3",
            "СЭЗт 23 9 3",
            "СЭЗТ-23-(9)-3",
            "Сэзт-23-(9)-3",
            "сэзт 23 9 3",
            "Сэзт 23 9 3",
            "сэзт-23-(9)-3",
            "СЭЗт-23-9-3",
            "СЭЗт-23-(9)-3",
            "сэзт-23-9-3",
            "Сэзт-23-9-3",
            "СЭЗТ-23-9-3"
        ],
        "department": "ПО",
        "specialty": "СЭЗт"
    },
    "807": {
        "name": "СЭЗт-23-(9)-4",
        "url": "https://coworking.tyuiu.ru/shs/po_t/po.php?action=group&union=0&sid=28706&gr=807&year=2025&vr=1",
        "aliases": [
            "СЭЗТ 23 9 4",
            "СЭЗТ-23-9-4",
            "СЭЗт 23 9 4",
            "сэзт-23-9-4",
            "сэзт 23 9 4",
            "СЭЗТ-23-(9)-4",
            "Сэзт 23 9 4",
            "сэзт-23-(9)-4",
            "Сэзт-23-9-4",
            "СЭЗт-23-(9)-4",
            "СЭЗт-23-9-4",
            "Сэзт-23-(9)-4"
        ],
        "department": "ПО",
        "specialty": "СЭЗт"
    },
    "808": {
        "name": "СЭЗт-23-(11)-1",
        "url": "https://coworking.tyuiu.ru/shs/po_t/po.php?action=group&union=0&sid=28706&gr=808&year=2025&vr=1",
        "aliases": [
            "СЭЗТ-23-11-1",
            "сэзт 23 11 1",
            "Сэзт-23-(11)-1",
            "СЭЗт-23-(11)-1",
            "Сэзт-23-11-1",
            "сэзт-23-11-1",
            "сэзт-23-(11)-1",
            "СЭЗт-23-11-1",
            "Сэзт 23 11 1",
            "СЭЗТ-23-(11)-1",
            "СЭЗт 23 11 1",
            "СЭЗТ 23 11 1"
        ],
        "department": "ПО",
        "specialty": "СЭЗт"
    },
    "827": {
        "name": "СЭЗт-24-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/po_t/po.php?action=group&union=0&sid=28706&gr=827&year=2025&vr=1",
        "aliases": [
            "Сэзт-24-(9)-1",
            "СЭЗт 24 9 1",
            "СЭЗТ-24-(9)-1",
            "Сэзт-24-9-1",
            "СЭЗТ-24-9-1",
            "СЭЗт-24-(9)-1",
            "СЭЗТ 24 9 1",
            "сэзт-24-9-1",
            "Сэзт 24 9 1",
            "сэзт-24-(9)-1",
            "сэзт 24 9 1",
            "СЭЗт-24-9-1"
        ],
        "department": "ПО",
        "specialty": "СЭЗт"
    },
    "828": {
        "name": "СЭЗт-24-(9)-2",
        "url": "https://coworking.tyuiu.ru/shs/po_t/po.php?action=group&union=0&sid=28706&gr=828&year=2025&vr=1",
        "aliases": [
            "СЭЗТ-24-9-2",
            "СЭЗт 24 9 2",
            "сэзт-24-(9)-2",
            "Сэзт-24-(9)-2",
            "Сэзт-24-9-2",
            "сэзт-24-9-2",
            "СЭЗт-24-9-2",
            "Сэзт 24 9 2",
            "СЭЗт-24-(9)-2",
            "сэзт 24 9 2",
            "СЭЗТ-24-(9)-2",
            "СЭЗТ 24 9 2"
        ],
        "department": "ПО",
        "specialty": "СЭЗт"
    },
    "829": {
        "name": "СЭЗт-24-(11)-1",
        "url": "https://coworking.tyuiu.ru/shs/po_t/po.php?action=group&union=0&sid=28706&gr=829&year=2025&vr=1",
        "aliases": [
            "Сэзт 24 11 1",
            "СЭЗТ-24-11-1",
            "СЭЗТ-24-(11)-1",
            "Сэзт-24-11-1",
            "СЭЗт-24-11-1",
            "сэзт 24 11 1",
            "СЭЗт 24 11 1",
            "Сэзт-24-(11)-1",
            "сэзт-24-11-1",
            "СЭЗт-24-(11)-1",
            "сэзт-24-(11)-1",
            "СЭЗТ 24 11 1"
        ],
        "department": "ПО",
        "specialty": "СЭЗт"
    },
    "830": {
        "name": "СЭЗт-24-(11)-2",
        "url": "https://coworking.tyuiu.ru/shs/po_t/po.php?action=group&union=0&sid=28706&gr=830&year=2025&vr=1",
        "aliases": [
            "Сэзт 24 11 2",
            "СЭЗт 24 11 2",
            "СЭЗт-24-(11)-2",
            "Сэзт-24-11-2",
            "СЭЗТ-24-(11)-2",
            "сэзт-24-(11)-2",
            "сэзт 24 11 2",
            "сэзт-24-11-2",
            "Сэзт-24-(11)-2",
            "СЭЗт-24-11-2",
            "СЭЗТ 24 11 2",
            "СЭЗТ-24-11-2"
        ],
        "department": "ПО",
        "specialty": "СЭЗт"
    },
    "649": {
        "name": "ЭТЭт-21-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/po_t/po.php?action=group&union=0&sid=28706&gr=649&year=2025&vr=1",
        "aliases": [
            "Этэт 21 9 1",
            "ЭТЭТ-21-(9)-1",
            "этэт 21 9 1",
            "ЭТЭт-21-(9)-1",
            "ЭТЭт-21-9-1",
            "этэт-21-9-1",
            "этэт-21-(9)-1",
            "Этэт-21-(9)-1",
            "Этэт-21-9-1",
            "ЭТЭт 21 9 1",
            "ЭТЭТ 21 9 1",
            "ЭТЭТ-21-9-1"
        ],
        "department": "ПО",
        "specialty": "ЭТЭт"
    },
    "650": {
        "name": "ЭТЭт-21-(9)-2",
        "url": "https://coworking.tyuiu.ru/shs/po_t/po.php?action=group&union=0&sid=28706&gr=650&year=2025&vr=1",
        "aliases": [
            "ЭТЭт 21 9 2",
            "этэт 21 9 2",
            "ЭТЭТ-21-9-2",
            "Этэт-21-(9)-2",
            "ЭТЭТ-21-(9)-2",
            "ЭТЭт-21-9-2",
            "этэт-21-(9)-2",
            "этэт-21-9-2",
            "ЭТЭт-21-(9)-2",
            "Этэт-21-9-2",
            "Этэт 21 9 2",
            "ЭТЭТ 21 9 2"
        ],
        "department": "ПО",
        "specialty": "ЭТЭт"
    },
    "722": {
        "name": "ЭТЭт-22-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/po_t/po.php?action=group&union=0&sid=28706&gr=722&year=2025&vr=1",
        "aliases": [
            "Этэт-22-9-1",
            "этэт-22-9-1",
            "этэт 22 9 1",
            "ЭТЭт 22 9 1",
            "Этэт 22 9 1",
            "ЭТЭт-22-9-1",
            "Этэт-22-(9)-1",
            "этэт-22-(9)-1",
            "ЭТЭт-22-(9)-1",
            "ЭТЭТ-22-9-1",
            "ЭТЭТ 22 9 1",
            "ЭТЭТ-22-(9)-1"
        ],
        "department": "ПО",
        "specialty": "ЭТЭт"
    },
    "723": {
        "name": "ЭТЭт-22-(9)-2",
        "url": "https://coworking.tyuiu.ru/shs/po_t/po.php?action=group&union=0&sid=28706&gr=723&year=2025&vr=1",
        "aliases": [
            "этэт-22-(9)-2",
            "Этэт-22-(9)-2",
            "Этэт 22 9 2",
            "этэт 22 9 2",
            "ЭТЭТ-22-9-2",
            "ЭТЭТ-22-(9)-2",
            "ЭТЭт-22-(9)-2",
            "Этэт-22-9-2",
            "ЭТЭт 22 9 2",
            "этэт-22-9-2",
            "ЭТЭТ 22 9 2",
            "ЭТЭт-22-9-2"
        ],
        "department": "ПО",
        "specialty": "ЭТЭт"
    },
    "809": {
        "name": "ЭТЭт-23-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/po_t/po.php?action=group&union=0&sid=28706&gr=809&year=2025&vr=1",
        "aliases": [
            "Этэт-23-(9)-1",
            "Этэт 23 9 1",
            "ЭТЭт-23-9-1",
            "этэт-23-9-1",
            "Этэт-23-9-1",
            "ЭТЭТ 23 9 1",
            "ЭТЭТ-23-9-1",
            "этэт-23-(9)-1",
            "ЭТЭт 23 9 1",
            "ЭТЭТ-23-(9)-1",
            "ЭТЭт-23-(9)-1",
            "этэт 23 9 1"
        ],
        "department": "ПО",
        "specialty": "ЭТЭт"
    },
    "810": {
        "name": "ЭТЭт-23-(9)-2",
        "url": "https://coworking.tyuiu.ru/shs/po_t/po.php?action=group&union=0&sid=28706&gr=810&year=2025&vr=1",
        "aliases": [
            "ЭТЭт 23 9 2",
            "ЭТЭт-23-(9)-2",
            "ЭТЭТ-23-9-2",
            "этэт 23 9 2",
            "Этэт-23-(9)-2",
            "Этэт 23 9 2",
            "ЭТЭТ-23-(9)-2",
            "ЭТЭТ 23 9 2",
            "ЭТЭт-23-9-2",
            "этэт-23-(9)-2",
            "этэт-23-9-2",
            "Этэт-23-9-2"
        ],
        "department": "ПО",
        "specialty": "ЭТЭт"
    },
    "835": {
        "name": "ЭТЭт-24-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/po_t/po.php?action=group&union=0&sid=28706&gr=835&year=2025&vr=1",
        "aliases": [
            "ЭТЭТ-24-(9)-1",
            "Этэт-24-(9)-1",
            "Этэт-24-9-1",
            "ЭТЭт-24-(9)-1",
            "ЭТЭТ-24-9-1",
            "этэт 24 9 1",
            "ЭТЭТ 24 9 1",
            "ЭТЭт-24-9-1",
            "этэт-24-(9)-1",
            "Этэт 24 9 1",
            "ЭТЭт 24 9 1",
            "этэт-24-9-1"
        ],
        "department": "ПО",
        "specialty": "ЭТЭт"
    },
    "836": {
        "name": "ЭТЭт-24-(9)-2",
        "url": "https://coworking.tyuiu.ru/shs/po_t/po.php?action=group&union=0&sid=28706&gr=836&year=2025&vr=1",
        "aliases": [
            "этэт-24-9-2",
            "Этэт 24 9 2",
            "этэт-24-(9)-2",
            "ЭТЭт-24-(9)-2",
            "Этэт-24-9-2",
            "ЭТЭТ-24-9-2",
            "ЭТЭт-24-9-2",
            "ЭТЭт 24 9 2",
            "Этэт-24-(9)-2",
            "ЭТЭТ 24 9 2",
            "ЭТЭТ-24-(9)-2",
            "этэт 24 9 2"
        ],
        "department": "ПО",
        "specialty": "ЭТЭт"
    }
}

def get_group_by_name(name):
    ... # см. оригинальную функцию
