def make_aliases(name):
    ... # см. оригинальную функцию

GROUPS_FULL = {
    "702": {
        "name": "ЗОт-22-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/sonh_po_t/sonh_po.php?action=group&union=0&sid=28702&gr=702&year=2025&vr=1",
        "aliases": [
            "ЗОТ-22-(9)-1",
            "зот-22-(9)-1",
            "ЗОТ 22 9 1",
            "зот-22-9-1",
            "Зот-22-(9)-1",
            "ЗОт-22-9-1",
            "Зот-22-9-1",
            "зот 22 9 1",
            "ЗОт-22-(9)-1",
            "ЗОт 22 9 1",
            "Зот 22 9 1",
            "ЗОТ-22-9-1"
        ],
        "department": "СОНХ",
        "specialty": "ЗОт"
    },
    "703": {
        "name": "ЗОт-22-(9)-2",
        "url": "https://coworking.tyuiu.ru/shs/sonh_po_t/sonh_po.php?action=group&union=0&sid=28702&gr=703&year=2025&vr=1",
        "aliases": [
            "Зот-22-(9)-2",
            "Зот-22-9-2",
            "ЗОТ 22 9 2",
            "ЗОт-22-9-2",
            "ЗОТ-22-9-2",
            "зот-22-9-2",
            "ЗОт 22 9 2",
            "ЗОт-22-(9)-2",
            "ЗОТ-22-(9)-2",
            "Зот 22 9 2",
            "зот-22-(9)-2",
            "зот 22 9 2"
        ],
        "department": "СОНХ",
        "specialty": "ЗОт"
    },
    "704": {
        "name": "ЗОт-22-(9)-3",
        "url": "https://coworking.tyuiu.ru/shs/sonh_po_t/sonh_po.php?action=group&union=0&sid=28702&gr=704&year=2025&vr=1",
        "aliases": [
            "зот 22 9 3",
            "ЗОТ 22 9 3",
            "ЗОт-22-9-3",
            "Зот 22 9 3",
            "Зот-22-(9)-3",
            "ЗОТ-22-(9)-3",
            "ЗОТ-22-9-3",
            "зот-22-9-3",
            "зот-22-(9)-3",
            "ЗОт-22-(9)-3",
            "Зот-22-9-3",
            "ЗОт 22 9 3"
        ],
        "department": "СОНХ",
        "specialty": "ЗОт"
    },
    "789": {
        "name": "ЗУт-23-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/sonh_po_t/sonh_po.php?action=group&union=0&sid=28702&gr=789&year=2025&vr=1",
        "aliases": [
            "ЗУТ-23-9-1",
            "Зут 23 9 1",
            "зут-23-(9)-1",
            "ЗУТ-23-(9)-1",
            "Зут-23-9-1",
            "ЗУт-23-9-1",
            "зут 23 9 1",
            "ЗУт-23-(9)-1",
            "Зут-23-(9)-1",
            "ЗУТ 23 9 1",
            "зут-23-9-1",
            "ЗУт 23 9 1"
        ],
        "department": "СОНХ",
        "specialty": "ЗУт"
    },
    "790": {
        "name": "ЗУт-23-(9)-2",
        "url": "https://coworking.tyuiu.ru/shs/sonh_po_t/sonh_po.php?action=group&union=0&sid=28702&gr=790&year=2025&vr=1",
        "aliases": [
            "ЗУт-23-(9)-2",
            "зут-23-9-2",
            "зут 23 9 2",
            "Зут-23-9-2",
            "Зут 23 9 2",
            "ЗУТ-23-(9)-2",
            "ЗУТ-23-9-2",
            "Зут-23-(9)-2",
            "ЗУТ 23 9 2",
            "ЗУт 23 9 2",
            "зут-23-(9)-2",
            "ЗУт-23-9-2"
        ],
        "department": "СОНХ",
        "specialty": "ЗУт"
    },
    "791": {
        "name": "ЗУт-23-(9)-3",
        "url": "https://coworking.tyuiu.ru/shs/sonh_po_t/sonh_po.php?action=group&union=0&sid=28702&gr=791&year=2025&vr=1",
        "aliases": [
            "ЗУТ 23 9 3",
            "ЗУТ-23-9-3",
            "Зут-23-(9)-3",
            "ЗУт-23-9-3",
            "Зут-23-9-3",
            "ЗУт-23-(9)-3",
            "зут-23-(9)-3",
            "зут 23 9 3",
            "ЗУТ-23-(9)-3",
            "зут-23-9-3",
            "Зут 23 9 3",
            "ЗУт 23 9 3"
        ],
        "department": "СОНХ",
        "specialty": "ЗУт"
    },
    "814": {
        "name": "ЗУт-24-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/sonh_po_t/sonh_po.php?action=group&union=0&sid=28702&gr=814&year=2025&vr=1",
        "aliases": [
            "ЗУТ 24 9 1",
            "ЗУт 24 9 1",
            "ЗУт-24-9-1",
            "Зут-24-(9)-1",
            "зут 24 9 1",
            "зут-24-(9)-1",
            "ЗУт-24-(9)-1",
            "зут-24-9-1",
            "ЗУТ-24-9-1",
            "Зут 24 9 1",
            "ЗУТ-24-(9)-1",
            "Зут-24-9-1"
        ],
        "department": "СОНХ",
        "specialty": "ЗУт"
    },
    "815": {
        "name": "ЗУт-24-(9)-2",
        "url": "https://coworking.tyuiu.ru/shs/sonh_po_t/sonh_po.php?action=group&union=0&sid=28702&gr=815&year=2025&vr=1",
        "aliases": [
            "Зут 24 9 2",
            "ЗУТ 24 9 2",
            "ЗУТ-24-9-2",
            "Зут-24-(9)-2",
            "ЗУт-24-(9)-2",
            "зут-24-9-2",
            "зут-24-(9)-2",
            "зут 24 9 2",
            "ЗУт 24 9 2",
            "ЗУт-24-9-2",
            "Зут-24-9-2",
            "ЗУТ-24-(9)-2"
        ],
        "department": "СОНХ",
        "specialty": "ЗУт"
    },
    "634": {
        "name": "ИСПт-21-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/sonh_po_t/sonh_po.php?action=group&union=0&sid=28702&gr=634&year=2025&vr=1",
        "aliases": [
            "ИСПТ 21 9 1",
            "испт-21-9-1",
            "Испт 21 9 1",
            "Испт-21-(9)-1",
            "Испт-21-9-1",
            "ИСПт-21-9-1",
            "ИСПт-21-(9)-1",
            "ИСПт 21 9 1",
            "ИСПТ-21-(9)-1",
            "испт 21 9 1",
            "испт-21-(9)-1",
            "ИСПТ-21-9-1"
        ],
        "department": "СОНХ",
        "specialty": "ИСПт"
    },
    "705": {
        "name": "ИСПт-22-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/sonh_po_t/sonh_po.php?action=group&union=0&sid=28702&gr=705&year=2025&vr=1",
        "aliases": [
            "ИСПт 22 9 1",
            "испт-22-(9)-1",
            "ИСПт-22-(9)-1",
            "испт-22-9-1",
            "Испт 22 9 1",
            "Испт-22-(9)-1",
            "ИСПт-22-9-1",
            "ИСПТ 22 9 1",
            "ИСПТ-22-9-1",
            "Испт-22-9-1",
            "ИСПТ-22-(9)-1",
            "испт 22 9 1"
        ],
        "department": "СОНХ",
        "specialty": "ИСПт"
    },
    "427": {
        "name": "ИСПт-22-(9)-2",
        "url": "https://coworking.tyuiu.ru/shs/sonh_po_t/sonh_po.php?action=group&union=0&sid=28702&gr=427&year=2025&vr=1",
        "aliases": [
            "испт-22-9-2",
            "ИСПТ-22-(9)-2",
            "Испт-22-9-2",
            "испт-22-(9)-2",
            "ИСПт-22-9-2",
            "Испт-22-(9)-2",
            "ИСПт 22 9 2",
            "ИСПт-22-(9)-2",
            "Испт 22 9 2",
            "ИСПТ 22 9 2",
            "испт 22 9 2",
            "ИСПТ-22-9-2"
        ],
        "department": "СОНХ",
        "specialty": "ИСПт"
    },
    "706": {
        "name": "ИСПт-22-(11)-1",
        "url": "https://coworking.tyuiu.ru/shs/sonh_po_t/sonh_po.php?action=group&union=0&sid=28702&gr=706&year=2025&vr=1",
        "aliases": [
            "испт 22 11 1",
            "ИСПт-22-(11)-1",
            "Испт-22-(11)-1",
            "Испт 22 11 1",
            "ИСПт-22-11-1",
            "испт-22-(11)-1",
            "ИСПт 22 11 1",
            "Испт-22-11-1",
            "испт-22-11-1",
            "ИСПТ 22 11 1",
            "ИСПТ-22-(11)-1",
            "ИСПТ-22-11-1"
        ],
        "department": "СОНХ",
        "specialty": "ИСПт"
    },
    "792": {
        "name": "ИСПт-23-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/sonh_po_t/sonh_po.php?action=group&union=0&sid=28702&gr=792&year=2025&vr=1",
        "aliases": [
            "испт-23-(9)-1",
            "Испт-23-(9)-1",
            "ИСПт-23-(9)-1",
            "ИСПТ 23 9 1",
            "ИСПТ-23-(9)-1",
            "ИСПт-23-9-1",
            "испт 23 9 1",
            "испт-23-9-1",
            "ИСПТ-23-9-1",
            "Испт 23 9 1",
            "Испт-23-9-1",
            "ИСПт 23 9 1"
        ],
        "department": "СОНХ",
        "specialty": "ИСПт"
    },
    "793": {
        "name": "ИСПт-23-(11)-1",
        "url": "https://coworking.tyuiu.ru/shs/sonh_po_t/sonh_po.php?action=group&union=0&sid=28702&gr=793&year=2025&vr=1",
        "aliases": [
            "ИСПТ-23-11-1",
            "Испт-23-(11)-1",
            "ИСПт 23 11 1",
            "ИСПт-23-11-1",
            "Испт-23-11-1",
            "ИСПТ-23-(11)-1",
            "ИСПт-23-(11)-1",
            "ИСПТ 23 11 1",
            "испт-23-11-1",
            "Испт 23 11 1",
            "испт-23-(11)-1",
            "испт 23 11 1"
        ],
        "department": "СОНХ",
        "specialty": "ИСПт"
    },
    "816": {
        "name": "ИСПт-24-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/sonh_po_t/sonh_po.php?action=group&union=0&sid=28702&gr=816&year=2025&vr=1",
        "aliases": [
            "испт 24 9 1",
            "ИСПТ-24-(9)-1",
            "ИСПТ 24 9 1",
            "испт-24-(9)-1",
            "ИСПт 24 9 1",
            "ИСПТ-24-9-1",
            "Испт-24-9-1",
            "Испт 24 9 1",
            "ИСПт-24-9-1",
            "ИСПт-24-(9)-1",
            "испт-24-9-1",
            "Испт-24-(9)-1"
        ],
        "department": "СОНХ",
        "specialty": "ИСПт"
    },
    "817": {
        "name": "ИСПт-24-(11)-1",
        "url": "https://coworking.tyuiu.ru/shs/sonh_po_t/sonh_po.php?action=group&union=0&sid=28702&gr=817&year=2025&vr=1",
        "aliases": [
            "Испт 24 11 1",
            "испт-24-(11)-1",
            "ИСПт 24 11 1",
            "испт-24-11-1",
            "ИСПт-24-11-1",
            "ИСПТ-24-11-1",
            "Испт-24-(11)-1",
            "испт 24 11 1",
            "Испт-24-11-1",
            "ИСПТ 24 11 1",
            "ИСПТ-24-(11)-1",
            "ИСПт-24-(11)-1"
        ],
        "department": "СОНХ",
        "specialty": "ИСПт"
    },
    "636": {
        "name": "РПКт-21-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/sonh_po_t/sonh_po.php?action=group&union=0&sid=28702&gr=636&year=2025&vr=1",
        "aliases": [
            "Рпкт-21-9-1",
            "рпкт-21-9-1",
            "РПКт-21-9-1",
            "Рпкт 21 9 1",
            "рпкт-21-(9)-1",
            "РПКТ 21 9 1",
            "РПКт-21-(9)-1",
            "рпкт 21 9 1",
            "РПКТ-21-(9)-1",
            "РПКТ-21-9-1",
            "Рпкт-21-(9)-1",
            "РПКт 21 9 1"
        ],
        "department": "СОНХ",
        "specialty": "РПКт"
    },
    "707": {
        "name": "РПКт-22-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/sonh_po_t/sonh_po.php?action=group&union=0&sid=28702&gr=707&year=2025&vr=1",
        "aliases": [
            "РПКТ-22-(9)-1",
            "РПКт 22 9 1",
            "рпкт-22-9-1",
            "РПКТ 22 9 1",
            "РПКт-22-9-1",
            "Рпкт-22-9-1",
            "Рпкт-22-(9)-1",
            "рпкт-22-(9)-1",
            "РПКт-22-(9)-1",
            "Рпкт 22 9 1",
            "РПКТ-22-9-1",
            "рпкт 22 9 1"
        ],
        "department": "СОНХ",
        "specialty": "РПКт"
    },
    "637": {
        "name": "СПт-21-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/sonh_po_t/sonh_po.php?action=group&union=0&sid=28702&gr=637&year=2025&vr=1",
        "aliases": [
            "СПт 21 9 1",
            "Спт-21-(9)-1",
            "СПт-21-(9)-1",
            "спт-21-(9)-1",
            "СПт-21-9-1",
            "Спт 21 9 1",
            "спт-21-9-1",
            "СПТ 21 9 1",
            "СПТ-21-9-1",
            "спт 21 9 1",
            "Спт-21-9-1",
            "СПТ-21-(9)-1"
        ],
        "department": "СОНХ",
        "specialty": "СПт"
    },
    "708": {
        "name": "СПт-22-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/sonh_po_t/sonh_po.php?action=group&union=0&sid=28702&gr=708&year=2025&vr=1",
        "aliases": [
            "СПт 22 9 1",
            "СПТ-22-(9)-1",
            "СПт-22-(9)-1",
            "СПТ-22-9-1",
            "спт-22-9-1",
            "СПТ 22 9 1",
            "спт-22-(9)-1",
            "спт 22 9 1",
            "Спт-22-(9)-1",
            "Спт-22-9-1",
            "СПт-22-9-1",
            "Спт 22 9 1"
        ],
        "department": "СОНХ",
        "specialty": "СПт"
    },
    "709": {
        "name": "СПт-22-(11)-1",
        "url": "https://coworking.tyuiu.ru/shs/sonh_po_t/sonh_po.php?action=group&union=0&sid=28702&gr=709&year=2025&vr=1",
        "aliases": [
            "СПт 22 11 1",
            "спт 22 11 1",
            "СПТ-22-11-1",
            "Спт-22-(11)-1",
            "СПТ 22 11 1",
            "СПТ-22-(11)-1",
            "Спт 22 11 1",
            "Спт-22-11-1",
            "СПт-22-(11)-1",
            "СПт-22-11-1",
            "спт-22-(11)-1",
            "спт-22-11-1"
        ],
        "department": "СОНХ",
        "specialty": "СПт"
    },
    "794": {
        "name": "СПт-23-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/sonh_po_t/sonh_po.php?action=group&union=0&sid=28702&gr=794&year=2025&vr=1",
        "aliases": [
            "спт-23-9-1",
            "СПт 23 9 1",
            "спт 23 9 1",
            "Спт 23 9 1",
            "СПТ-23-9-1",
            "СПт-23-9-1",
            "Спт-23-9-1",
            "СПт-23-(9)-1",
            "спт-23-(9)-1",
            "Спт-23-(9)-1",
            "СПТ-23-(9)-1",
            "СПТ 23 9 1"
        ],
        "department": "СОНХ",
        "specialty": "СПт"
    },
    "795": {
        "name": "СПт-23-(11)-1",
        "url": "https://coworking.tyuiu.ru/shs/sonh_po_t/sonh_po.php?action=group&union=0&sid=28702&gr=795&year=2025&vr=1",
        "aliases": [
            "СПт 23 11 1",
            "СПТ 23 11 1",
            "Спт-23-(11)-1",
            "спт 23 11 1",
            "спт-23-(11)-1",
            "СПт-23-(11)-1",
            "СПт-23-11-1",
            "спт-23-11-1",
            "СПТ-23-11-1",
            "Спт 23 11 1",
            "Спт-23-11-1",
            "СПТ-23-(11)-1"
        ],
        "department": "СОНХ",
        "specialty": "СПт"
    },
    "818": {
        "name": "СПт-24-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/sonh_po_t/sonh_po.php?action=group&union=0&sid=28702&gr=818&year=2025&vr=1",
        "aliases": [
            "Спт-24-(9)-1",
            "СПт-24-(9)-1",
            "спт-24-(9)-1",
            "СПт 24 9 1",
            "СПт-24-9-1",
            "СПТ-24-(9)-1",
            "спт 24 9 1",
            "Спт-24-9-1",
            "Спт 24 9 1",
            "СПТ 24 9 1",
            "спт-24-9-1",
            "СПТ-24-9-1"
        ],
        "department": "СОНХ",
        "specialty": "СПт"
    },
    "819": {
        "name": "СПт-24-(9)-2",
        "url": "https://coworking.tyuiu.ru/shs/sonh_po_t/sonh_po.php?action=group&union=0&sid=28702&gr=819&year=2025&vr=1",
        "aliases": [
            "СПТ-24-(9)-2",
            "спт-24-9-2",
            "СПт-24-(9)-2",
            "Спт 24 9 2",
            "СПТ-24-9-2",
            "Спт-24-9-2",
            "спт 24 9 2",
            "спт-24-(9)-2",
            "Спт-24-(9)-2",
            "СПт 24 9 2",
            "СПт-24-9-2",
            "СПТ 24 9 2"
        ],
        "department": "СОНХ",
        "specialty": "СПт"
    },
    "820": {
        "name": "СПт-24-(11)-1",
        "url": "https://coworking.tyuiu.ru/shs/sonh_po_t/sonh_po.php?action=group&union=0&sid=28702&gr=820&year=2025&vr=1",
        "aliases": [
            "спт 24 11 1",
            "СПт-24-(11)-1",
            "Спт-24-(11)-1",
            "спт-24-(11)-1",
            "СПт-24-11-1",
            "СПТ-24-11-1",
            "Спт 24 11 1",
            "спт-24-11-1",
            "СПт 24 11 1",
            "СПТ 24 11 1",
            "СПТ-24-(11)-1",
            "Спт-24-11-1"
        ],
        "department": "СОНХ",
        "specialty": "СПт"
    },
    "796": {
        "name": "ЭБКт-23-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/sonh_po_t/sonh_po.php?action=group&union=0&sid=28702&gr=796&year=2025&vr=1",
        "aliases": [
            "ЭБКТ 23 9 1",
            "эбкт 23 9 1",
            "ЭБКт-23-9-1",
            "Эбкт-23-9-1",
            "эбкт-23-(9)-1",
            "ЭБКТ-23-9-1",
            "эбкт-23-9-1",
            "Эбкт-23-(9)-1",
            "ЭБКТ-23-(9)-1",
            "ЭБКт 23 9 1",
            "Эбкт 23 9 1",
            "ЭБКт-23-(9)-1"
        ],
        "department": "СОНХ",
        "specialty": "ЭБКт"
    },
    "821": {
        "name": "ЭБКт-24-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/sonh_po_t/sonh_po.php?action=group&union=0&sid=28702&gr=821&year=2025&vr=1",
        "aliases": [
            "Эбкт-24-9-1",
            "ЭБКТ-24-(9)-1",
            "ЭБКТ-24-9-1",
            "Эбкт 24 9 1",
            "ЭБКт-24-(9)-1",
            "ЭБКт 24 9 1",
            "эбкт-24-9-1",
            "ЭБКТ 24 9 1",
            "эбкт-24-(9)-1",
            "эбкт 24 9 1",
            "ЭБКт-24-9-1",
            "Эбкт-24-(9)-1"
        ],
        "department": "СОНХ",
        "specialty": "ЭБКт"
    },
    "822": {
        "name": "ЭБКт-24-(11)-1",
        "url": "https://coworking.tyuiu.ru/shs/sonh_po_t/sonh_po.php?action=group&union=0&sid=28702&gr=822&year=2025&vr=1",
        "aliases": [
            "ЭБКт-24-(11)-1",
            "ЭБКт 24 11 1",
            "эбкт 24 11 1",
            "ЭБКт-24-11-1",
            "эбкт-24-(11)-1",
            "ЭБКТ 24 11 1",
            "Эбкт-24-(11)-1",
            "эбкт-24-11-1",
            "Эбкт 24 11 1",
            "Эбкт-24-11-1",
            "ЭБКТ-24-11-1",
            "ЭБКТ-24-(11)-1"
        ],
        "department": "СОНХ",
        "specialty": "ЭБКт"
    },
    "571": {
        "name": "ЭГНт-20-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/sonh_po_t/sonh_po.php?action=group&union=0&sid=28702&gr=571&year=2025&vr=1",
        "aliases": [
            "эгнт 20 9 1",
            "ЭГНт-20-9-1",
            "эгнт-20-(9)-1",
            "ЭГНт 20 9 1",
            "ЭГНт-20-(9)-1",
            "Эгнт-20-(9)-1",
            "эгнт-20-9-1",
            "Эгнт 20 9 1",
            "ЭГНТ 20 9 1",
            "Эгнт-20-9-1",
            "ЭГНТ-20-9-1",
            "ЭГНТ-20-(9)-1"
        ],
        "department": "СОНХ",
        "specialty": "ЭГНт"
    },
    "572": {
        "name": "ЭГНт-20-(9)-2",
        "url": "https://coworking.tyuiu.ru/shs/sonh_po_t/sonh_po.php?action=group&union=0&sid=28702&gr=572&year=2025&vr=1",
        "aliases": [
            "эгнт 20 9 2",
            "ЭГНТ-20-(9)-2",
            "Эгнт 20 9 2",
            "ЭГНт-20-(9)-2",
            "Эгнт-20-9-2",
            "ЭГНТ-20-9-2",
            "эгнт-20-(9)-2",
            "ЭГНТ 20 9 2",
            "ЭГНт 20 9 2",
            "Эгнт-20-(9)-2",
            "эгнт-20-9-2",
            "ЭГНт-20-9-2"
        ],
        "department": "СОНХ",
        "specialty": "ЭГНт"
    },
    "639": {
        "name": "ЭГНт-21-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/sonh_po_t/sonh_po.php?action=group&union=0&sid=28702&gr=639&year=2025&vr=1",
        "aliases": [
            "ЭГНт-21-9-1",
            "ЭГНт 21 9 1",
            "ЭГНт-21-(9)-1",
            "эгнт 21 9 1",
            "Эгнт 21 9 1",
            "эгнт-21-(9)-1",
            "Эгнт-21-(9)-1",
            "ЭГНТ-21-(9)-1",
            "ЭГНТ-21-9-1",
            "ЭГНТ 21 9 1",
            "Эгнт-21-9-1",
            "эгнт-21-9-1"
        ],
        "department": "СОНХ",
        "specialty": "ЭГНт"
    },
    "640": {
        "name": "ЭГНт-21-(9)-2",
        "url": "https://coworking.tyuiu.ru/shs/sonh_po_t/sonh_po.php?action=group&union=0&sid=28702&gr=640&year=2025&vr=1",
        "aliases": [
            "ЭГНт 21 9 2",
            "ЭГНТ-21-9-2",
            "Эгнт-21-9-2",
            "эгнт-21-9-2",
            "Эгнт-21-(9)-2",
            "ЭГНТ 21 9 2",
            "ЭГНт-21-9-2",
            "ЭГНт-21-(9)-2",
            "эгнт 21 9 2",
            "эгнт-21-(9)-2",
            "ЭГНТ-21-(9)-2",
            "Эгнт 21 9 2"
        ],
        "department": "СОНХ",
        "specialty": "ЭГНт"
    },
    "710": {
        "name": "ЭГНт-22-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/sonh_po_t/sonh_po.php?action=group&union=0&sid=28702&gr=710&year=2025&vr=1",
        "aliases": [
            "ЭГНт-22-(9)-1",
            "Эгнт-22-9-1",
            "ЭГНт 22 9 1",
            "ЭГНт-22-9-1",
            "Эгнт 22 9 1",
            "эгнт-22-(9)-1",
            "ЭГНТ-22-(9)-1",
            "ЭГНТ 22 9 1",
            "Эгнт-22-(9)-1",
            "ЭГНТ-22-9-1",
            "эгнт 22 9 1",
            "эгнт-22-9-1"
        ],
        "department": "СОНХ",
        "specialty": "ЭГНт"
    },
    "711": {
        "name": "ЭГНт-22-(9)-2",
        "url": "https://coworking.tyuiu.ru/shs/sonh_po_t/sonh_po.php?action=group&union=0&sid=28702&gr=711&year=2025&vr=1",
        "aliases": [
            "Эгнт-22-(9)-2",
            "Эгнт-22-9-2",
            "эгнт-22-(9)-2",
            "ЭГНТ 22 9 2",
            "ЭГНт-22-(9)-2",
            "эгнт 22 9 2",
            "ЭГНт-22-9-2",
            "ЭГНТ-22-(9)-2",
            "эгнт-22-9-2",
            "Эгнт 22 9 2",
            "ЭГНт 22 9 2",
            "ЭГНТ-22-9-2"
        ],
        "department": "СОНХ",
        "specialty": "ЭГНт"
    },
    "712": {
        "name": "ЭГНт-22-(9)-3",
        "url": "https://coworking.tyuiu.ru/shs/sonh_po_t/sonh_po.php?action=group&union=0&sid=28702&gr=712&year=2025&vr=1",
        "aliases": [
            "Эгнт 22 9 3",
            "эгнт-22-(9)-3",
            "ЭГНт 22 9 3",
            "Эгнт-22-9-3",
            "ЭГНТ-22-(9)-3",
            "Эгнт-22-(9)-3",
            "эгнт-22-9-3",
            "эгнт 22 9 3",
            "ЭГНт-22-(9)-3",
            "ЭГНт-22-9-3",
            "ЭГНТ 22 9 3",
            "ЭГНТ-22-9-3"
        ],
        "department": "СОНХ",
        "specialty": "ЭГНт"
    },
    "713": {
        "name": "ЭГНт-22-(11)-1",
        "url": "https://coworking.tyuiu.ru/shs/sonh_po_t/sonh_po.php?action=group&union=0&sid=28702&gr=713&year=2025&vr=1",
        "aliases": [
            "ЭГНт-22-11-1",
            "эгнт-22-(11)-1",
            "ЭГНт 22 11 1",
            "ЭГНт-22-(11)-1",
            "эгнт-22-11-1",
            "эгнт 22 11 1",
            "ЭГНТ-22-(11)-1",
            "ЭГНТ 22 11 1",
            "Эгнт-22-11-1",
            "ЭГНТ-22-11-1",
            "Эгнт-22-(11)-1",
            "Эгнт 22 11 1"
        ],
        "department": "СОНХ",
        "specialty": "ЭГНт"
    },
    "797": {
        "name": "ЭГНт-23-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/sonh_po_t/sonh_po.php?action=group&union=0&sid=28702&gr=797&year=2025&vr=1",
        "aliases": [
            "ЭГНТ-23-(9)-1",
            "ЭГНТ-23-9-1",
            "Эгнт 23 9 1",
            "ЭГНТ 23 9 1",
            "Эгнт-23-9-1",
            "ЭГНт-23-9-1",
            "ЭГНт-23-(9)-1",
            "ЭГНт 23 9 1",
            "Эгнт-23-(9)-1",
            "эгнт 23 9 1",
            "эгнт-23-(9)-1",
            "эгнт-23-9-1"
        ],
        "department": "СОНХ",
        "specialty": "ЭГНт"
    },
    "798": {
        "name": "ЭГНт-23-(9)-2",
        "url": "https://coworking.tyuiu.ru/shs/sonh_po_t/sonh_po.php?action=group&union=0&sid=28702&gr=798&year=2025&vr=1",
        "aliases": [
            "эгнт-23-(9)-2",
            "ЭГНТ-23-9-2",
            "эгнт-23-9-2",
            "Эгнт-23-(9)-2",
            "Эгнт 23 9 2",
            "Эгнт-23-9-2",
            "ЭГНт 23 9 2",
            "ЭГНт-23-(9)-2",
            "ЭГНТ-23-(9)-2",
            "эгнт 23 9 2",
            "ЭГНТ 23 9 2",
            "ЭГНт-23-9-2"
        ],
        "department": "СОНХ",
        "specialty": "ЭГНт"
    },
    "799": {
        "name": "ЭГНт-23-(11)-1",
        "url": "https://coworking.tyuiu.ru/shs/sonh_po_t/sonh_po.php?action=group&union=0&sid=28702&gr=799&year=2025&vr=1",
        "aliases": [
            "ЭГНт 23 11 1",
            "ЭГНт-23-(11)-1",
            "эгнт 23 11 1",
            "Эгнт-23-(11)-1",
            "ЭГНТ-23-(11)-1",
            "эгнт-23-11-1",
            "эгнт-23-(11)-1",
            "ЭГНт-23-11-1",
            "Эгнт 23 11 1",
            "ЭГНТ 23 11 1",
            "Эгнт-23-11-1",
            "ЭГНТ-23-11-1"
        ],
        "department": "СОНХ",
        "specialty": "ЭГНт"
    },
    "823": {
        "name": "ЭГНт-24-(9)-1",
        "url": "https://coworking.tyuiu.ru/shs/sonh_po_t/sonh_po.php?action=group&union=0&sid=28702&gr=823&year=2025&vr=1",
        "aliases": [
            "Эгнт-24-9-1",
            "ЭГНт-24-(9)-1",
            "Эгнт-24-(9)-1",
            "Эгнт 24 9 1",
            "эгнт 24 9 1",
            "эгнт-24-9-1",
            "ЭГНТ-24-9-1",
            "ЭГНт 24 9 1",
            "ЭГНТ-24-(9)-1",
            "эгнт-24-(9)-1",
            "ЭГНТ 24 9 1",
            "ЭГНт-24-9-1"
        ],
        "department": "СОНХ",
        "specialty": "ЭГНт"
    },
    "824": {
        "name": "ЭГНт-24-(9)-2",
        "url": "https://coworking.tyuiu.ru/shs/sonh_po_t/sonh_po.php?action=group&union=0&sid=28702&gr=824&year=2025&vr=1",
        "aliases": [
            "ЭГНт-24-(9)-2",
            "ЭГНТ 24 9 2",
            "Эгнт 24 9 2",
            "эгнт-24-9-2",
            "ЭГНТ-24-(9)-2",
            "Эгнт-24-(9)-2",
            "ЭГНт 24 9 2",
            "ЭГНТ-24-9-2",
            "Эгнт-24-9-2",
            "эгнт-24-(9)-2",
            "ЭГНт-24-9-2",
            "эгнт 24 9 2"
        ],
        "department": "СОНХ",
        "specialty": "ЭГНт"
    },
    "825": {
        "name": "ЭГНт-24-(11)-1",
        "url": "https://coworking.tyuiu.ru/shs/sonh_po_t/sonh_po.php?action=group&union=0&sid=28702&gr=825&year=2025&vr=1",
        "aliases": [
            "ЭГНт 24 11 1",
            "ЭГНт-24-(11)-1",
            "Эгнт 24 11 1",
            "Эгнт-24-11-1",
            "эгнт-24-(11)-1",
            "Эгнт-24-(11)-1",
            "эгнт-24-11-1",
            "ЭГНт-24-11-1",
            "ЭГНТ-24-11-1",
            "ЭГНТ-24-(11)-1",
            "эгнт 24 11 1",
            "ЭГНТ 24 11 1"
        ],
        "department": "СОНХ",
        "specialty": "ЭГНт"
    }
}

def get_group_by_name(name):
    ... # см. оригинальную функцию
